[
{
"name": "Donald Trump",
"summary": "u'Donald John Trump (born June 14, 1946) is an American businessman, television personality, author, politician, and the Republican Party nominee for President of the United States in the 2016 election. He is chairman of The Trump Organization, which is the principal holding company for his real estate ventures and other business interests.\nBorn and raised in New York City, Trump received a bachelor\'s degree in economics from the Wharton School of the University of Pennsylvania in 1968. While attending college, Trump worked in his father Fred Trump\'s real estate and construction firm. He was given control of the business in 1971 and later renamed it "The Trump Organization". During his career, Trump has built skyscrapers, hotels, casinos, golf courses, and numerous other developments across North and South America, Europe and Asia, many of which bear his name, such as the Trump Place apartment complex in Manhattan. He sought the Reform Party presidential nomination in 2000, but withdrew before voting began. Listed by Forbes among the world\'s wealthiest 500 billionaires, Trump and his businesses, as well as his personal life and political views, have for decades received considerable media exposure. He hosted and co-produced The Apprentice, a reality television series on NBC, from 2004 to 2015, for which he received a star on the Hollywood Walk of Fame. He has made cameo appearances in films and television series, and appeared at the Miss USA pageants, which he owned from 1996 to 2015.\nIn June 2015, Trump announced his candidacy for president as a Republican and quickly emerged as the front-runner for his party\'s nomination. In May 2016, his remaining Republican rivals suspended their campaigns, and in July he was formally nominated for president at the 2016 Republican National Convention.\nTrump\'s 2016 presidential campaign has received extensive media coverage and international attention. Many of his statements in interviews, on Twitter, and at campaign rallies have been controversial or false. Several rallies have been accompanied by protests or riots. Trump\'s positions include renegotiation of U.S.–China trade deals, opposition to particular trade agreements such as the TPP, stronger enforcement of immigration laws together with building a wall along the U.S.–Mexico border, reform of veterans\' care, replacement of the Affordable Care Act, and tax cuts. Trump has suggested temporarily banning foreign Muslims from entering the United States, which he later said would focus instead on countries with a proven history of terrorism, until the level of vetting can be raised to screen out potential terrorists.'"
},
{
"name": "Hillary Clinton",
"summary": "(/ˈhɪləri daɪˈ\xe6n ˈrɒdəm ˈklɪntən/; born October 26, 1947) is an American politician and the nominee of the Democratic Party for President of the United States in the 2016 election. She served as the 67th United States Secretary of State from 2009 to 2013, the junior United States Senator representing New York from 2001 to 2009, First Lady of the United States during the presidency of Bill Clinton from 1993 to 2001, and First Lady of Arkansas during his governorship from 1979 to 1981 and from 1983 to 1992.\nBorn in Chicago and raised in the suburban town of Park Ridge, Illinois, Clinton attended Wellesley College, graduating in 1969, and earned a J.D. from Yale Law School in 1973. After serving as a congressional legal counsel, she moved to Arkansas, marrying Bill Clinton in 1975. In 1977, she co-founded Arkansas Advocates for Children and Families. She was appointed the first female chair of the Legal Services Corporation in 1978, and, the following year, became the first woman partner at Rose Law Firm. As First Lady of Arkansas, she led a task force whose recommendations helped reform Arkansas\'s public schools, and served on several corporate boards.\nAs First Lady of the United States, Clinton led the unsuccessful effort to enact the Clinton health care plan of 1993. In 1997 and 1999, she helped create the State Children\'s Health Insurance Program. She also tackled the problems of adoption and family safety and foster care. At the 1995 UN conference on women, held in Beijing, Clinton stated in a then controversial and influential speech, that "human rights are women\'s rights and women\'s rights are human rights". Her marriage endured the Lewinsky scandal of 1998, and her role as first lady drew a polarized response from the public.\nClinton was elected in 2000 as the first female senator from New York, the only first lady ever to have sought elective office. Following the September 11 attacks, she voted to approve the war in Afghanistan. She also voted for the Iraq Resolution (a vote she later said she regretted). She took a leading role in investigating the health issues faced by 9/11 first responders. She voted against the Bush tax cuts. She was re-elected to the Senate in 2006. Running for president in 2008, she won far more delegates than any previous female candidate, but lost the Democratic nomination to Barack Obama.\nAs Secretary of State in the Obama administration from 2009 to 2013, Clinton responded to the Arab Spring, during which she advocated the U.S. military intervention in Libya. She helped organize a diplomatic isolation and international sanctions regime against Iran, in an effort to force curtailment of that country\'s nuclear program; this would eventually lead to the multinational Joint Comprehensive Plan of Action agreement in 2015. Leaving office after Obama\'s first term, she wrote her fifth book and undertook speaking engagements before announcing her second presidential run in the 2016 election.\nClinton received the most votes and primary delegates in the 2016 Democratic primaries, formally accepting her party\'s nomination for President of the United States on July 28, 2016, with vice presidential running mate, Senator Tim Kaine. She became the first female candidate to be nominated for president by a major U.S. political party. As part of her 2016 platform, she has emphasized raising incomes, improvements to the Affordable Care Act and reform of campaign finance and Wall Street. She favors allowing pathways to citizenship for undocumented immigrants, expanding and protecting LGBT and women\'s rights, and instituting family support through paid parental leave and universal preschool.'"
},
{
"name": "Jill Stein",
"summary": ""
},(born May 14, 1950) is an American physician, activist and politician. She is the Green Party's nominee for President of the United States in the 2016 election. Stein was also the Green Party's presidential nominee in 2012. She ran for governor of Massachusetts in 2002 and 2010."
{
"name": "Gary Johnson",
"summary": "(born January 1, 1953) is an American businessman, author, politician, and the Libertarian Party nominee for President of the United States in the 2016 election. He served as the 29th Governor of New Mexico from 1995 to 2003 as a member of the Republican Party. He was also the Libertarian Party's nominee for President of the United States in the 2012 election.\nJohnson founded one of New Mexico's largest construction companies. He entered politics for the first time by running for Governor of New Mexico in 1994 on a low-tax, anti-crime platform, promising a 'common sense business approach'. He beat incumbent Democratic governor Bruce King by 50% to 40%. He cut the 10% annual growth in the budget: in part, due to his use of the gubernatorial veto 200 times during his first six months.\nJohnson sought re-election in 1998, winning by 55% to 45%. In his second term, he concentrated on the issue of school voucher reforms, as well as campaigning for marijuana decriminalization. During his tenure as governor, Johnson adhered to an anti-tax and anti-bureaucracy policy, setting state and national records for his use of veto powers: more than the other 49 contemporary governors put together. Term-limited, Johnson retired from front-line politics in 2003. In May 2003, he climbed Mount Everest.\nJohnson ran for president in 2012, initially as a Republican on a libertarian platform emphasizing the United States public debt and a balanced budget, protection of civil liberties, military non-interventionism, replacement of income tax with the FairTax, and opposition to the War on Drugs. In December 2011, he withdrew his candidacy for the Republican nomination and stood for the Libertarian nomination instead, winning the nomination in May 2012. Johnson received 1.3 million votes (0.99%): more than all other minor candidates combined and the most votes in Libertarian Party history.\nOn January 6, 2016, Johnson announced his candidacy for the Libertarian nomination again in 2016. Johnson won the Libertarian nomination in May 2016, with former Republican Governor of Massachusetts William Weld as his running mate. In August, Johnson's poll numbers began to approach the 15% threshold necessary to make him the first third party candidate since Ross Perot in 1992 to participate in the broadcast, fall presidential debates."
}
]
