[{"left_office": "1797-03-04", "img": "https://upload.wikimedia.org/wikipedia/commons/4/40/Virginia_State_Capitol_complex_-_Houdon%27s_Washington%2C_seen_from_the_front.jpg", "death_year": 1799, "number": 1, "summary": "George Washington (February 22, 1732 [O.S. February 11, 1731] – December 14, 1799) was the first President of the United States (1789–97), the Commander-in-Chief of the Continental Army during the American Revolutionary War, and one of the Founding Fathers of the United States. He presided over the convention that drafted the current United States Constitution and during his lifetime was called the \"father of his country\".\nWidely admired for his strong leadership qualities, Washington was unanimously elected president by the Electoral College in the first two national elections. He oversaw the creation of a strong, well-financed national government that maintained neutrality in the French Revolutionary Wars, suppressed the Whiskey Rebellion, and won acceptance among Americans of all types. Washington's incumbency established many precedents, still in use today, such as the cabinet system, the inaugural address, and the title Mr. President. His retirement from office after two terms established a tradition that lasted until 1940, when Franklin Delano Roosevelt won an unprecedented third term. The 22nd Amendment (1951) now limits the president to two elected terms. Born into the provincial gentry of Colonial Virginia, his family were wealthy planters who owned tobacco plantations and slaves which he inherited. In his youth he became a senior officer in the colonial militia during the first stages of the French and Indian War. In 1775 the Second Continental Congress commissioned Washington as commander-in-chief of the Continental Army in the American Revolution. In that command, Washington forced the British out of Boston in 1776, but was defeated and nearly captured later that year when he lost New York City. After crossing the Delaware River in the middle of winter, he defeated the British in two battles (Trenton and Princeton), retook New Jersey and restored momentum to the Patriot cause.\nHis strategy enabled Continental forces to capture two major British armies at Saratoga in 1777 and Yorktown in 1781. Historians laud Washington for the selection and supervision of his generals, preservation and command of the army, coordination with the Congress, state governors and their militia, and attention to supplies, logistics, and training. In battle, however, Washington was repeatedly outmaneuvered by British generals with larger armies. After victory had been finalized in 1783, Washington resigned as commander-in-chief rather than seize power, proving his opposition to dictatorship and his commitment to American republicanism. Washington presided over the Constitutional Convention in 1787, which devised a new form of federal government for the United States. Following his election as president in 1789, he worked to unify rival factions in the fledgling nation. He supported Alexander Hamilton's programs to satisfy all debts, federal and state, established a permanent seat of government, implemented an effective tax system, and created a national bank. In avoiding war with Great Britain, he guaranteed a decade of peace and profitable trade by securing the Jay Treaty in 1795, despite intense opposition from the Jeffersonians. Although he remained nonpartisan, never joining the Federalist Party, he largely supported its policies. Washington's Farewell Address was an influential primer on civic virtue, warning against partisanship, sectionalism, and involvement in foreign wars. He retired from the presidency in 1797, returning to his home and plantation at Mount Vernon.\nWhile in power, his use of national authority pursued many ends, especially the preservation of liberty, reduction of regional tensions, and promotion of a spirit of American nationalism. Upon his death, Washington was eulogized as \"first in war, first in peace, and first in the hearts of his countrymen\" by Henry Lee. Revered in life and in death, scholarly and public polling consistently ranks him among the top three presidents in American history; he has been depicted and remembered in monuments, currency, and other dedications through the present day.\n\n", "party": "No Party", "president": "George Washington", "birth_year": 1732, "took_office": "1789-04-30"}, {"left_office": "1801-03-04", "img": "https://upload.wikimedia.org/wikipedia/commons/a/a6/StatenIslandConference_By_Chappel.jpg", "death_year": 1826, "number": 2, "summary": "John Adams (October 30 [O.S. October 19] 1735 – July 4, 1826) was an American lawyer, author, statesman, and diplomat. He served as the second President of the United States (1797–1801), the first Vice President (1789–97), and as a Founding Father was a leader of American independence from Great Britain. Adams was a political theorist in the Age of Enlightenment who promoted republicanism and a strong central government. His innovative ideas were frequently published. He was also a dedicated diarist and correspondent, particularly with his wife and key advisor Abigail.\nHe collaborated with his cousin, revolutionary leader Samuel Adams, but he established his own prominence prior to the American Revolution. After the Boston Massacre, despite severe local anti-British sentiment, he provided a successful though unpopular legal defense of the accused British soldiers, driven by his devotion to the right to counsel and the \"protect[ion] of innocence\". As a delegate from Massachusetts to the Continental Congress, Adams played a leading role in persuading Congress to declare independence. He assisted Thomas Jefferson in drafting the Declaration of Independence in 1776, and was its foremost advocate in the Congress. As a diplomat in Europe, he helped negotiate the eventual peace treaty with Great Britain, and acquired vital governmental loans from Amsterdam bankers. Adams was the primary author of the Massachusetts Constitution in 1780 which influenced American political theory, as did his earlier Thoughts on Government (1776).\nAdams' credentials as a revolutionary secured for him two terms as President George Washington's vice president (1789 to 1797) and also his own election in 1796 as the second president. In his single term as president, he encountered fierce criticism from the Jeffersonian Republicans, as well as the dominant faction in his own Federalist Party, led by his rival Alexander Hamilton. Adams signed the controversial Alien and Sedition Acts, and built up the army and navy in the face of an undeclared naval \"Quasi-War\" with France. The major accomplishment of his presidency was a peaceful resolution of the conflict in the face of Hamilton's opposition. Due to his strong posture on defense, Adams is \"often called the father of the American Navy\". He was the first U.S. president to reside in the executive mansion, now known as the White House.\nIn 1800, Adams lost re-election to Thomas Jefferson, and retired to Massachusetts. He eventually resumed his friendship with Jefferson upon the latter's own retirement by initiating a correspondence which lasted fourteen years. He and his wife established a family of politicians, diplomats, and historians now referred to as the Adams political family. Adams was the father of John Quincy Adams, the sixth President of the United States. He died on the fiftieth anniversary of the adoption of the Declaration of Independence. Modern historians in the aggregate have ranked his administration favorably.", "party": "Federalist", "president": "John Adams", "birth_year": 1735, "took_office": "1797-03-04"}, {"left_office": "1809-03-04", "img": "https://upload.wikimedia.org/wikipedia/commons/2/2b/Thomas_Jefferson_Memorial_front.jpg", "death_year": 1826, "number": 3, "summary": "Thomas Jefferson (April 13 [O.S. April 2] 1743 – July 4, 1826) was an American Founding Father and the principal author of the Declaration of Independence (1776). He was elected the second Vice President of the United States (1797–1801), serving under John Adams and in 1800 was elected the third President (1801–09). Jefferson was a proponent of democracy, republicanism, and individual rights, which motivated American colonists to break from Great Britain and form a new nation. He produced formative documents and decisions at both the state and national level.\nPrimarily of English ancestry, Jefferson was born and educated in Virginia. He graduated from the College of William & Mary and briefly practiced law, at times defending slaves seeking their freedom. During the American Revolution, he represented Virginia in the Continental Congress that adopted the Declaration, drafted the law for religious freedom as a Virginia legislator, and served as a wartime governor (1779–1781). He became the United States Minister to France in May 1785, and subsequently the nation's first Secretary of State in 1790–1793 under President George Washington. Jefferson and James Madison organized the Democratic-Republican Party to oppose the Federalist Party during the formation of the First Party System. With Madison, he anonymously wrote the Kentucky and Virginia Resolutions in 1798–1799, which sought to embolden states' rights in opposition to the national government by nullifying the Alien and Sedition Acts.\nAs President Jefferson pursued the nation's shipping and trade interests against Barbary pirates and aggressive British trade policies respectively. He also organized the Louisiana Purchase almost doubling the country's territory. As a result of peace negotiations with France, his administration reduced military forces. He was reelected in 1804. Jefferson's second term was beset with difficulties at home, including the trial of former Vice President Aaron Burr. American foreign trade was diminished when Jefferson implemented the Embargo Act of 1807, responding to British threats to U.S. shipping. In 1803, Jefferson began a controversial process of Indian tribe removal to the newly organized Louisiana Territory, and, in 1807, signed the Act Prohibiting Importation of Slaves.\nJefferson mastered many disciplines which ranged from surveying and mathematics to horticulture and mechanics. He was a proven architect in the classical tradition. Jefferson's keen interest in religion and philosophy earned him the presidency of the American Philosophical Society. He shunned organized religion, but was influenced by both Christianity and deism. He was well versed in linguistics and spoke several languages. He founded the University of Virginia after retiring from public office. He was a prolific letter writer and corresponded with many prominent and important people throughout his adult life. His only full-length book, Notes on the State of Virginia (1785), is considered the most important American book published before 1800.\nJefferson owned several plantations which were worked by hundreds of slaves. Most historians now believe that after the death of his wife in 1782, he had a relationship with his slave Sally Hemings and fathered at least one of her children. Historians have lauded Jefferson's public life, noting his primary authorship of the Declaration of Independence during the Revolutionary War, his advocacy of religious freedom and tolerance in Virginia, and the Louisiana Purchase while he was president. Various modern scholars are more critical of Jefferson's private life, pointing out for example the discrepancy between his ownership of slaves and his liberal political principles. Presidential scholars consistently rank Jefferson among the greatest presidents.", "party": "Democratic-Republican", "president": "Thomas Jefferson", "birth_year": 1743, "took_office": "1801-03-04"}, {"left_office": "1817-03-04", "img": "https://upload.wikimedia.org/wikipedia/en/f/fd/Portal-puzzle.svg", "death_year": 1836, "number": 4, "summary": "James Madison, Jr. (March 16 [O.S. March 5] 1751 – June 28, 1836) was a political theorist, American statesman, and the fourth President of the United States (1809–17). He is hailed as the \"Father of the Constitution\" for his pivotal role in drafting and promoting the U.S. Constitution and the Bill of Rights.\nMadison inherited his plantation Montpelier in Virginia and owned hundreds of slaves during his lifetime. He served as both a member of the Virginia House of Delegates and as a member of the Continental Congress prior to the Constitutional Convention. After the Convention, he became one of the leaders in the movement to ratify the Constitution, both nationally and in Virginia. His collaboration with Alexander Hamilton and John Jay produced The Federalist Papers, among the most important treatises in support of the Constitution. Madison changed his political views during his life. During deliberations on the constitution, he favored a strong national government, but later preferred stronger state governments, before settling between the two extremes late in his life.\nIn 1789, Madison became a leader in the new House of Representatives, drafting many basic laws. He is noted for drafting the first ten amendments to the Constitution, and thus is known also as the \"Father of the Bill of Rights\". He worked closely with President George Washington to organize the new federal government. Breaking with Hamilton and the Federalist Party in 1791, he and Thomas Jefferson organized the Democratic-Republican Party. In response to the Alien and Sedition Acts, Jefferson and Madison drafted the Kentucky and Virginia Resolutions arguing that states can nullify unconstitutional laws.\nAs Jefferson's Secretary of State (1801–09), Madison supervised the Louisiana Purchase, which doubled the nation's size. Madison succeeded Jefferson as President in 1809, was re-elected in 1813, and presided over renewed prosperity for several years. After the failure of diplomatic protests and a trade embargo against the United Kingdom, he led the U.S. into the War of 1812. The war was an administrative morass, as the United States had neither a strong army nor financial system. As a result, Madison afterward supported a stronger national government and a strong military, as well as the national bank, which he had long opposed.", "party": "Democratic-Republican", "president": "James Madison", "birth_year": 1751, "took_office": "1809-03-04"}, {"left_office": "1825-03-04", "img": "https://upload.wikimedia.org/wikipedia/commons/a/ac/US-%24100-SC-1891-Fr.344.jpg", "death_year": 1831, "number": 5, "summary": "James Monroe (/mənˈroʊ/; April 28, 1758 – July 4, 1831) was the fifth President of the United States, serving between 1817 and 1825. Monroe was the last president who was a Founding Father of the United States and the last president from the Virginian dynasty and the Republican Generation. Born in Westmoreland County, Virginia, Monroe was of the planter class and fought in the American Revolutionary War. He was wounded in the Battle of Trenton with a musket ball to his shoulder. After studying law under Thomas Jefferson from 1780 to 1783, he served as a delegate in the Continental Congress. As an anti-federalist delegate to the Virginia convention that considered ratification of the United States Constitution, Monroe opposed ratification, claiming it gave too much power to the central government. He took an active part in the new government, and in 1790 he was elected to the Senate of the first United States Congress, where he joined the Jeffersonians. He gained experience as an executive as the Governor of Virginia and rose to national prominence as a diplomat in France, when he helped negotiate the Louisiana Purchase in 1803. During the War of 1812, Monroe held the critical roles of Secretary of State and the Secretary of War under President James Madison.\nFacing little opposition from the fractured Federalist Party, Monroe was easily elected president in 1816, winning over 80 percent of the electoral vote and becoming the last president during the First Party System era of American politics. As president, he bought Florida from Spain and sought to ease partisan tensions, embarking on a tour of the country that was generally well received. With the ratification of the Treaty of 1818, under the successful diplomacy of his Secretary of State John Quincy Adams, the United States extended from the Atlantic to the Pacific, giving America harbor and fishing rights in the Pacific Northwest. The United States and Britain jointly occupied the Oregon Country. In addition to the acquisition of Florida, the landmark Treaty of 1819 secured the border of the United States along the 42nd Parallel to the Pacific Ocean and represented America's first determined attempt at creating an \"American global empire\". As nationalism surged, partisan fury subsided and the \"Era of Good Feelings\" ensued until the Panic of 1819 struck and dispute over the admission of Missouri embroiled the country in 1820. Nonetheless, Monroe won near-unanimous reelection.\nMonroe supported the founding of colonies in Africa for freed slaves that would eventually form the nation of Liberia, whose capital, Monrovia, is named in his honor. In 1823, he announced the United States' opposition to any European intervention in the recently independent countries of the Americas with the Monroe Doctrine, which became a landmark in American foreign policy. His presidency concluded the first period of American presidential history before the beginning of Jacksonian democracy and the Second Party System era. Following his retirement in 1825, Monroe was plagued by financial difficulties. He died in New York City on July 4, 1831.\n\n", "party": "Democratic-Republican", "president": "James Monroe", "birth_year": 1758, "took_office": "1817-03-04"}, {"left_office": "1829-03-04", "img": "https://upload.wikimedia.org/wikipedia/en/8/82/JQ_Adams_Vault%2C_Hancock_Cemetery.jpg", "death_year": 1848, "number": 6, "summary": "John Quincy Adams (/ˈkwɪnzi/; July 11, 1767 – February 23, 1848) was an American statesman who served as the sixth President of the United States from 1825 to 1829. He also served as a diplomat, a Senator and member of the House of Representatives. He was a member of the Federalist, Democratic-Republican, National Republican, and later Anti-Masonic and Whig parties.\nIn his biography, Samuel Flagg Bemis argues that Adams was able to \"gather together, formulate, and practice the fundamentals of American foreign-policy – self-determination, independence, noncolonization, nonintervention, nonentanglement in European politics, Freedom of the Seas, [and] freedom of commerce.\"\nJohn Quincy Adams was the son of President John Adams and Abigail Adams. As a diplomat, Adams played an important role in negotiating key treaties, most notably the Treaty of Ghent, which ended the War of 1812. As Secretary of State, he negotiated with Britain over the United States' northern border with Canada, negotiated with Spain the annexation of Florida, and drafted the Monroe Doctrine. Historians agree he was one of the greatest diplomats and secretaries of state in American history.\nAdams was elected president in a close and controversial four-way contest in 1824. As president he sought to modernize the American economy and promote education. Adams enacted a part of his agenda and paid off much of the national debt. However he was stymied time and again by a Congress controlled by his enemies, and his lack of patronage networks helped politicians eager to undercut him. He lost his 1828 bid for re-election to Andrew Jackson.\nAdams is best known as a diplomat who shaped U.S. foreign policy in line with his ardently nationalist commitment to U.S. republican values. More recently, he has been portrayed as the exemplar and moral leader in an era of modernization. During Adams' lifetime, technological innovations and new means of communication spread messages of religious revival, social reform, and party politics. Goods, money, and people traveled more rapidly and efficiently than ever before.\nAdams was elected as U.S. Representative from Massachusetts after leaving office, serving for the last 17 years of his life with far greater acclaim than he had achieved as president. Animated by his growing revulsion against slavery, Adams became a leading opponent of the Slave Power. He predicted that if a civil war were to break out, the president could abolish slavery by using his war powers. Adams also predicted the Union's dissolution over the slavery issue, but said that if the South became independent there would be a series of bloody slave revolts.", "party": "Democratic-Republican", "president": "John Quincy Adams", "birth_year": 1767, "took_office": "1825-03-04"}, {"left_office": "1837-03-04", "img": "https://upload.wikimedia.org/wikipedia/commons/1/1b/Wikiversity-logo-en.svg", "death_year": 1845, "number": 7, "summary": "Andrew Jackson (March 15, 1767 – June 8, 1845) was an American statesman who served as the seventh President of the United States from 1829 to 1837. He was born near the end of the colonial era, somewhere near the then-unmarked border between North and South Carolina, into a recently immigrated Scots-Irish farming family of relatively modest means. During the American Revolutionary War, Jackson, whose family supported the revolutionary cause, acted as a courier. At age 13, he was captured and mistreated by the British army. He later became a lawyer. He was also elected to Congressional office, first to the U.S. House of Representatives and twice to the U.S. Senate.\nIn 1801, Jackson was appointed colonel in the Tennessee militia, which became his political as well as military base. He owned hundreds of slaves who worked on the Hermitage Plantation. In 1806, he killed a man in a duel over a matter of honor regarding his wife Rachel. He gained national fame through his role in the War of 1812, most famously where he won a decisive victory over the main British invasion army at the Battle of New Orleans, albeit some weeks after the Treaty of Ghent had already been signed (unbeknownst to the combatants). In response to conflict with the Seminole in Spanish Florida, he invaded the territory in 1818. This led directly to the First Seminole War and the Adams–Onís Treaty of 1819, which formally transferred Florida from Spain to the United States.\nAfter winning election to the Senate, Jackson decided to run for president in 1824. Although he got a plurality in both electoral and popular vote against three major candidates, Jackson failed to get a majority and lost in the House of Representatives to John Quincy Adams. Jackson claimed that he lost by a \"corrupt bargain\" between Adams and Speaker of the House Henry Clay, who was also a candidate, to give Clay the office of Secretary of State in exchange for Adams winning the presidency. Jackson's supporters then founded what became the Democratic Party. He ran again for president in 1828 against Adams. Building on his base in the West and with new support from Virginia and New York, he won by a landslide. He blamed the death of his wife, Rachel, which occurred just after the election, on the Adams campaigners, who called her a \"bigamist\".\nAs president, Jackson faced a threat of secession by South Carolina over the \"Tariff of Abominations\", which Congress had enacted under Adams. In contrast to several of his immediate successors, he denied the right of a state to secede from the union or to nullify federal law. The Nullification Crisis was defused when the tariff was amended and Jackson threatened the use of military force if South Carolina attempted to secede.\nIn anticipation of the 1832 election, Congress, led by Clay, attempted to reauthorize the Second Bank of the United States four years before the expiration of its charter. In keeping with his platform of economic decentralization, Jackson vetoed the renewal of its charter, thereby seemingly putting his chances for reelection in jeopardy. However, by portraying himself as the defender of the common person against wealthy bankers, he was able to defeat Clay in the election that year. He thoroughly dismantled the bank by the time its charter expired in 1836. His struggles with Congress were personified in his personal rivalry with Clay, whom Jackson deeply disliked and who led the opposition of the emerging Whig Party. Jackson's presidency marked the beginning of the ascendancy of the \"spoils system\" in American politics. He is also known for having signed the Indian Removal Act in 1830, which forcibly relocated a number of native tribes in the South to Indian Territory (now Oklahoma).\nJackson supported his vice president Martin Van Buren's successful presidential campaign in 1836. He worked to bolster the Democratic Party and helped his friend James K. Polk win the 1844 presidential election.\n\n", "party": "Democratic", "president": "Andrew Jackson", "birth_year": 1767, "took_office": "1829-03-04"}, {"left_office": "1841-03-04", "img": "https://upload.wikimedia.org/wikipedia/commons/1/1f/Martin_Van_Buren_by_Mathew_Brady_c1855-58.jpg", "death_year": 1862, "number": 8, "summary": "Martin Van Buren (Dutch: Maarten van Buren pronunciation ; December 5, 1782 – July 24, 1862) was an American politician who served as the eighth President of the United States (1837–41). A member of the Democratic Party, he served in a number of senior roles, including eighth Vice President (1833–37) and tenth Secretary of State (1829–31), both under Andrew Jackson. Van Buren's inability as president to deal with the deep economic depression following the Panic of 1837 and with the surging Whig Party led to his defeat in the 1840 election.\nOf Dutch ancestry, Van Buren learned early to interact with people from multiple ethnic, income, and societal groups, which he used to his advantage as a political organizer. A meticulous dresser, he could mingle in upper class society as well as in saloon environments like the tavern his father ran. A delegate to a political convention at age 18, he quickly moved from local to state politics, gaining fame both as a political organizer and an accomplished lawyer. Elected to the Senate by the state legislature in 1821, Van Buren supported William H. Crawford for president in the 1824 election, but by 1828 had come to support General Andrew Jackson. Van Buren was a major supporter and organizer for Jackson in the 1828 election. Jackson was elected, and made Van Buren Secretary of State.\nDuring Jackson's eight years as president, Van Buren was a key advisor, and built the organizational structure for the coalescing Democratic Party, particularly in New York. In 1831, following his resignation as Secretary of State, Jackson gave Van Buren a recess appointment as American minister to Britain, but Van Buren's nomination was rejected by the Senate, cutting short his service in London. He was successful in the jockeying to become Jackson's picked successor, and was elected vice president in 1832. Van Buren defeated several Whig opponents in 1836, and was elected president.\nAs president, Van Buren was blamed for the depression of 1837; hostile newspapers called him \"Martin Van Ruin\". He attempted to cure the economic problems by keeping control of federal funds in an independent treasury—rather than in state banks—but Congress would not approve of this until 1840. In foreign affairs, he denied the application of Texas for admission to the Union, unwilling to upset the balance of free and slave states in the Missouri Compromise, and hoping to avoid war with Mexico over Texas annexation by purchasing the territory from Mexico's government. Additionally, relations with Britain and its colonies in Canada proved to be strained from the bloodless Aroostook War and the Caroline Affair.\nIn 1840, Van Buren was voted out of office, losing to Whig candidate William Henry Harrison. Van Buren was the leading candidate for the Democratic nomination in 1844, but lost to James K. Polk, who went on to win the election. In the 1848 election Van Buren ran unsuccessfully as the candidate of the anti-slavery Free Soil Party. He returned to the Democratic fold to support Franklin Pierce (1852), James Buchanan (1856), and Stephen A. Douglas (1860) for the presidency, but his increasingly abolitionist views and support for the Union led him to support Abraham Lincoln's policies after the start of the American Civil War.\nVan Buren's health began to fail in 1861, and he died in July 1862 at the age of seventy-nine. Although he served in many high offices, his most lasting achievement was as a political organizer who built the modern Democratic Party and guided it to dominance in the new Second Party System.\n\n", "party": "Democratic", "president": "Martin Van Buren", "birth_year": 1782, "took_office": "1837-03-04"}, {"left_office": "1841-04-04", "img": "https://upload.wikimedia.org/wikipedia/commons/6/67/HARRISON%2C_William_H-President_%28BEP_engraved_portrait%29.jpg", "death_year": 1841, "number": 9, "summary": "William Henry Harrison (February 9, 1773 – April 4, 1841) was the ninth President of the United States (1841), an American military officer and politician, and the last president born as a British subject. He was also the first president to die in office. He was 68 years, 23 days old when inaugurated, the oldest president to take office until Ronald Reagan in 1981. Harrison died on his 32nd day in office of complications from pneumonia, serving the shortest tenure in United States presidential history. His death sparked a brief constitutional crisis, but its resolution left unsettled many questions following the presidential line of succession in regard to Constitution until the passage of the 25th Amendment in 1967. He was the grandfather of Benjamin Harrison, who served as the 23rd President from 1889 to 1893.\nBefore election as president, Harrison served as the first territorial congressional delegate from the Northwest Territory, as governor of the Indiana Territory, and later as a U.S. representative and senator from Ohio. He originally gained national fame for leading U.S. forces against American Indians at the Battle of Tippecanoe in 1811, where he earned the nickname \"Tippecanoe\" (or \"Old Tippecanoe\"). As a general in the subsequent War of 1812, his most notable action was in the Battle of the Thames in 1813. This battle resulted in the death of Tecumseh and the dissolution of the Indian coalition which he led.\nAfter the war, Harrison moved to Ohio, where he was elected to the United States House of Representatives. In 1824, the state legislature elected him to the U.S. Senate. He served a truncated term after being appointed as Minister Plenipotentiary to Gran Colombia in May 1828. In Santa Fe de Bogotá, he spoke with president Simón Bolívar, urging his nation to adopt American-style democracy.\nReturning to his farm in Ohio, Harrison lived in relative retirement until he was nominated for the presidency as one of several Whig Party candidates in the election of 1836. He received more votes than any other Whig, but was defeated by Democrat Martin Van Buren. He retired again to his farm.\nVan Buren soon became a major target of criticism from the Whigs surrounding economic difficulties following the Panic of 1837. Seeking to run a non-controversial and less ideological war hero who could defeat Van Buren based on popularity, a unified Whig Party nominated Harrison over party founder Henry Clay and fellow general Winfield Scott. John Tyler of Virginia was selected as his running mate. Harrison and Tyler defeated Van Buren in the 1840 election. However, Harrison died of pneumonia in April 1841, a month after taking office. He had the shortest tenure of any president in history, and was the first president to die in office. Tyler then assumed all of the powers and duties of the president, setting a major precedent.", "party": "Whig", "president": "William Henry Harrison", "birth_year": 1773, "took_office": "1841-03-04"}, {"left_office": "1845-03-04", "img": "https://upload.wikimedia.org/wikipedia/commons/9/93/TYLER%2C_John-President_%28BEP_engraved_portrait%29.jpg", "death_year": 1862, "number": 10, "summary": "John Tyler (March 29, 1790 – January 18, 1862) was the tenth President of the United States (1841–45). He was also, briefly, the tenth vice president (1841), elected to that office on the 1840 Whig ticket with William Henry Harrison. Tyler became president after Harrison's death in April 1841, only a month after the start of the new administration. Known to that point as a supporter of states' rights, which endeared him to his fellow Virginians, his actions as president showed that he was willing to back nationalist policies as long as they did not infringe on the powers of the states. Still, the circumstances of his unexpected rise to the presidency, and its threat to the presidential ambitions of Henry Clay and other politicians, left him estranged from both major parties. A firm believer in manifest destiny, President Tyler sought to strengthen and preserve the Union through territorial expansion, most notably the annexation of the independent Republic of Texas in his last days in office.\nTyler, born to an eminent Virginia family, came to national prominence at a time of political upheaval. In the 1820s the nation's only political party, the Democratic-Republicans, split into factions. Though initially a Democrat, his opposition to Andrew Jackson and Martin Van Buren led him to ally with the Whig Party. Tyler served as a Virginia state legislator, governor, U.S. representative, and U.S. senator before his election as vice president in the presidential election of 1840. He was put on the ticket to attract states' rights Southerners to what was then a Whig coalition to defeat Van Buren's re-election bid.\nHarrison's death made Tyler the first vice president to succeed to the presidency without being elected to the office. Because of the short duration of Harrison's one-month term, Tyler served longer than any president in U.S. history who was never elected to the office. To forestall constitutional uncertainty, Tyler immediately took the oath of office, moved into the White House, and assumed full presidential powers, a precedent that would govern future successions and eventually become codified in the Twenty-fifth Amendment. A strict constructionist, Tyler found much of the Whig platform unconstitutional, and vetoed several of his party's bills. Believing that the president should set policy instead of deferring to Congress, he attempted to bypass the Whig establishment, most notably Kentucky Senator Henry Clay. Most of Tyler's Cabinet resigned soon into his term, and the Whigs, dubbing him His Accidency, expelled him from the party. Though Tyler was not the first president to veto bills, he was the first to see his veto overridden by Congress. Although he faced a stalemate on domestic policy, he had several foreign-policy achievements, including the Webster–Ashburton Treaty with Britain and the Treaty of Wanghia with Qing China.\nPresident Tyler dedicated his last two years in office to the annexation of Texas. He initially sought election to a full term as president, but after failing to gain the support of either Whigs or Democrats, he withdrew. In the last days of his term, Congress passed the resolution authorizing the Texas annexation, which was carried out by Tyler's successor, James K. Polk. When the American Civil War began in 1861, Tyler sided with the Confederate government, and won election to the Confederate House of Representatives shortly before his death. Although some have praised Tyler's political resolve, his presidency is generally held in low esteem by historians; today he is considered an obscure president, with little presence in the American cultural memory.", "party": "Whig", "president": "John Tyler", "birth_year": 1790, "took_office": "1841-04-04"}, {"left_office": "1849-03-04", "img": "https://upload.wikimedia.org/wikipedia/commons/4/41/Wpdms_oregon_territory_1848.png", "death_year": 1849, "number": 11, "summary": "James Knox Polk (November 2, 1795 – June 15, 1849) was the 11th President of the United States (1845–49). Polk was born in Mecklenburg County, North Carolina. He later lived in and represented Tennessee. A Democrat, Polk served as the 13th Speaker of the House of Representatives (1835–39)—the only president to have served as House Speaker—and Governor of Tennessee (1839–41). Polk was the surprise (dark horse) candidate for president in 1844, defeating Henry Clay of the rival Whig Party by promising to annex the Republic of Texas. Polk was a leader of Jacksonian Democracy during the Second Party System.\nPolk is often considered the last strong pre–Civil War president, having met during his four years in office every major domestic and foreign policy goal set during his campaign and the transition to his administration. When Mexico rejected the U.S. annexation of Texas (which Mexico considered part of its territory, despite the 1836 Texas Revolution), Polk led the nation to a sweeping victory in the Mexican–American War, which resulted in the cession by Mexico of nearly the whole of what is now the American Southwest. He ensured a substantial reduction of tariff rates by replacing the \"Black Tariff\" with the Walker tariff of 1846, which pleased the less-industrialized states of his native South by rendering less expensive both imported and, through competition, domestic goods. He threatened war with the United Kingdom over the issue of which nation owned the Oregon Country, eventually reaching a settlement in which the British were made to sell the portion that became the Oregon Territory. Additionally, he built an independent treasury system that lasted until 1913, oversaw the opening of the U.S. Naval Academy and of the Smithsonian Institution, the groundbreaking for the Washington Monument, and the issuance of the first United States postage stamp.\nTrue to his campaign pledge to serve only one term as President, Polk left office and returned to Tennessee in March 1849. He died of cholera three months later.\nScholars have ranked him favorably on lists of greatest presidents for his ability to promote, obtain support for, and achieve all of the major items on his presidential agenda. Polk has been called the \"least known consequential president\" of the United States.\n\n", "party": "Democratic", "president": "James K. Polk", "birth_year": 1795, "took_office": "1845-03-04"}, {"left_office": "1850-07-09", "img": "https://upload.wikimedia.org/wikipedia/commons/6/6b/Zachary_Taylor_by_Joseph_Henry_Bush%2C_c1848.jpg", "death_year": 1850, "number": 12, "summary": "Zachary Taylor (November 24, 1784 – July 9, 1850) was the 12th President of the United States, serving from March 1849 until his death in July 1850. Before his presidency, Taylor was a career officer in the United States Army, rising to the rank of major general.\nTaylor's status as a national hero as a result of his victories in the Mexican-American War won him election to the White House despite his vague political beliefs. His top priority as president was preserving the Union, but he died seventeen months into his term, before making any progress on the status of slavery, which had been inflaming tensions in Congress.\nTaylor was born into a prominent family of planters who migrated westward from Virginia to Kentucky in his youth.\nTaylor was commissioned as an officer in the U.S. Army in 1808 and made a name for himself as a captain in the War of 1812. He climbed the ranks establishing military forts along the Mississippi River and entered the Black Hawk War as a colonel in 1832. His success in the Second Seminole War attracted national attention and earned him the nickname \"Old Rough and Ready\".\nIn 1845, as the annexation of Texas was underway, President James K. Polk dispatched Taylor to the Rio Grande area in anticipation of a potential battle with Mexico over the disputed Texas–Mexico border. The Mexican–American War broke out in April 1846. In May, Taylor defeated Mexican troops commanded by General Mariano Arista at the Battles of Palo Alto and Resaca de la Palma, and managed to drive his troops out of Texas. Taylor subsequently led his troops into Mexico, where they once again defeated Mexican troops commanded by Pedro de Ampudia at the Battle of Monterrey in September. Taylor subsequently defied orders by moving his troops further south, where, despite being severely outnumbered, he dealt a crushing blow to Mexican forces under Antonio López de Santa Anna in February 1847 at the Battle of Buena Vista. After this, most of Taylor's troops were transferred to the command of Major General Winfield Scott, but Taylor's popularity remained significant.\nThe Whig Party convinced the reluctant Taylor to lead their ticket, despite his unclear platform and lack of interest in politics. He won the election alongside New York politician Millard Fillmore, defeating Democratic candidates Lewis Cass and William Orlando Butler, as well as a third party effort led by former President Martin Van Buren and Charles Francis Adams, Sr. of the Free Soil Party. As president, Taylor kept his distance from Congress and his cabinet, even as partisan tensions threatened to divide the Union. Debate over the slave status of the large territories claimed in the war led to threats of secession from Southerners.\nDespite being a Southerner and a slaveholder himself, Taylor did not push for the expansion of slavery. To avoid the question, he urged settlers in New Mexico and California to bypass the territorial stage and draft constitutions for statehood, setting the stage for the Compromise of 1850. Taylor died suddenly of a stomach-related illness in July 1850, so had little impact on the sectional divide that led to civil war a decade later.", "party": "Whig", "president": "Zachary Taylor", "birth_year": 1784, "took_office": "1849-03-04"}, {"left_office": "1853-03-04", "img": "https://upload.wikimedia.org/wikipedia/en/c/ca/Fillmore_plot_plaque.jpg", "death_year": 1874, "number": 13, "summary": "Millard Fillmore (January 7, 1800 – March 8, 1874) was an American statesman who served as the 13th President of the United States from 1850 to 1853. He was the last Whig president, and the last president not to be affiliated with either the Democratic or Republican parties. Fillmore was the only Whig president who did not die in office or get expelled from the party, and Fillmore appointed the only Whig Supreme Court Justice. As Zachary Taylor's vice president, he assumed the presidency after Taylor's death. Fillmore was a lawyer from western New York state, and an early member of the Whig Party. He served in the state legislature (1829–1831), as a U.S. Representative (1833–35, 1837–43), and as New York State Comptroller (1848–49). He was elected vice president of the United States in 1848 as Taylor's running mate, and served from 1849 until Taylor's death in 1850, at the height of the \"Crisis of 1850\" over slavery.\nAs an anti-slavery moderate, he opposed abolitionist demands to exclude slavery from all the territory gained in the Mexican War. Instead he supported the Compromise of 1850, which briefly ended the crisis. In foreign policy, Fillmore supported U.S. Navy expeditions to open trade in Japan, opposed French designs on Hawaii, and was embarrassed by Narciso López's filibuster expeditions to Cuba. He sought election to a full term in 1852, but was passed over for the nomination by the Whigs. When the Whig Party broke up in 1854–56, Fillmore refused to join the Republican Party. Unlike many other conservative Whigs, Fillmore did not join the American Party, the political arm of the anti-immigrant, anti-Catholic \"Know-Nothing\" movement. While out of the country, he was nevertheless nominated by the American Party as their candidate for President in 1856. He finished third in the election, surpassed by the Republican Party candidate. During the American Civil War, Fillmore denounced secession and agreed that the Union must be maintained by force if necessary, but was very critical of the war policies of President Abraham Lincoln. After the war, he supported the Reconstruction policies of President Andrew Johnson. Although some have praised Fillmore's restrained foreign policy, he is criticized for having further aggravated tensions between abolitionists and slaveholders. He is placed near the bottom 10 of historical rankings of Presidents of the United States by various scholarly surveys.\nFillmore founded the University at Buffalo and was the university's first chancellor. He also helped found the Buffalo Historical Society and the Buffalo General Hospital.", "party": "Whig", "president": "Millard Fillmore", "birth_year": 1800, "took_office": "1850-07-09"}, {"left_office": "1857-03-04", "img": "https://upload.wikimedia.org/wikipedia/commons/4/46/Mathew_Brady_-_Franklin_Pierce_-_alternate_crop.jpg", "death_year": 1869, "number": 14, "summary": "Franklin Pierce (November 23, 1804 – October 8, 1869) was the 14th President of the United States (1853–57). Pierce was a northern Democrat who saw the abolitionist movement as a fundamental threat to the unity of the nation. His polarizing actions in championing and signing the Kansas–Nebraska Act and enforcing the Fugitive Slave Act failed to stem intersectional conflict, setting the stage for Southern secession.\nBorn in New Hampshire, Pierce served in the U.S. House of Representatives and the Senate until he resigned from the latter in 1842. His private law practice in his home state was a success; he was appointed U.S. Attorney for his state in 1845. Pierce took part in the Mexican–American War as a brigadier general in the Army. Seen by Democrats as a compromise candidate uniting northern and southern interests, he was nominated as the party's candidate for president on the 49th ballot at the 1852 Democratic National Convention. In the 1852 presidential election, Pierce and his running mate William R. King easily defeated the Whig Party ticket of Winfield Scott and William A. Graham.\nWhile Pierce was popular and outgoing, his family life was a grim affair, with his wife Jane suffering from illness and depression for much of her life. All of their children died young, their last son being gruesomely killed in a train accident while the family was traveling shortly before Pierce's inauguration. As president, Pierce simultaneously attempted to enforce neutral standards for civil service while also satisfying the diverse elements of the Democratic Party with patronage, an effort which largely failed and turned many in his party against him. Pierce was a Young America expansionist who signed the Gadsden Purchase of land from Mexico and led a failed attempt to acquire Cuba from Spain. He signed trade treaties with Britain and Japan, while his Cabinet reformed their departments and improved accountability, but these successes were overshadowed by political strife.\nHis popularity in the Northern states declined sharply after he supported the Kansas–Nebraska Act, which nullified the Missouri Compromise, while many whites in the South continued to support him. Passage of the act led to violent conflict over the expansion of slavery in the American West. Pierce's administration was further damaged when several of his diplomats issued the Ostend Manifesto, calling for the annexation of Cuba, a document which was roundly criticized. Although Pierce fully expected to be renominated by the Democrats in the 1856 presidential election, he was abandoned by his party and his bid failed. His reputation in the North suffered further during the Civil War as he became a vocal critic of President Abraham Lincoln. Pierce, who had been a heavy drinker for much of his life, died of severe cirrhosis of the liver in 1869. US historians and other political commentators generally rank Pierce's presidency among the worst.", "party": "Democratic", "president": "Franklin Pierce", "birth_year": 1804, "took_office": "1853-03-04"}, {"left_office": "1861-03-04", "img": "https://upload.wikimedia.org/wikipedia/en/5/58/Padlock-olive.svg", "death_year": 1868, "number": 15, "summary": "James Buchanan, Jr. (/ˈbʌkænən/, also /bjuːˈkænən/; April 23, 1791 – June 1, 1868) was the 15th President of the United States (1857–61), serving immediately prior to the American Civil War. He represented Pennsylvania in the United States House of Representatives and later the Senate, then served as Minister to Russia under President Andrew Jackson. He was named Secretary of State under President James K. Polk, and as of 2016 is the last former Secretary of State to serve as President of the United States. After Buchanan turned down an offer to sit on the Supreme Court, President Franklin Pierce appointed him Ambassador to the United Kingdom, in which capacity he helped draft the Ostend Manifesto.\nBuchanan was nominated by the Democratic Party in the 1856 presidential election. Throughout most of Pierce's presidency, Buchanan had been stationed in London as minister to the Court of St. James's and so was not caught up in the crossfire of sectional politics that dominated the country. His subsequent election victory took place in a three-man race with John C. Frémont and Millard Fillmore. As President, he was often called a \"doughface\", a Northerner with Southern sympathies, who battled with Stephen A. Douglas for control of the Democratic Party. Buchanan's efforts to maintain peace between the North and the South alienated both sides, and the Southern states declared their secession in the prologue to the American Civil War. Buchanan's view was that secession was illegal, but that going to war to stop it was also illegal. Buchanan, an attorney, was noted for his mantra, \"I acknowledge no master but the law.\"\nBy the time he left office, popular opinion was against him and the Democratic Party had split. Buchanan had once aspired to be a president who would rank in history with George Washington. However, his inability to identify a ground for peace or address the sharply divided pro-slavery and anti-slavery partisans with a unifying principle on the brink of the Civil War has led to his consistent ranking by historians as one of the worst presidents in American history. Historians in both 2006 and 2009 voted his failure to deal with secession the worst presidential mistake ever made.\nHe is, to date, the only president from Pennsylvania and the only president to remain a lifelong bachelor. He was the last president born in the 18th century.", "party": "Democratic", "president": "James Buchanan", "birth_year": 1791, "took_office": "1857-03-04"}, {"left_office": "1865-04-15", "img": "https://upload.wikimedia.org/wikipedia/commons/f/f5/Young_Lincoln_By_Charles_Keck.JPG", "death_year": 1865, "number": 16, "summary": "Abraham Lincoln (/ˈeɪbrəhæm ˈlɪŋkən/; February 12, 1809 – April 15, 1865) was an American politician and lawyer who served as the 16th President of the United States from March 1861 until his assassination in April 1865. Lincoln led the United States through its Civil War—its bloodiest war and its greatest moral, constitutional, and political crisis. In doing so, he preserved the Union, abolished slavery, strengthened the federal government, and modernized the economy.\nBorn in Hodgenville, Kentucky, Lincoln grew up on the western frontier in Kentucky and Indiana. Largely self-educated, he became a lawyer in Illinois, a Whig Party leader, and a member of the Illinois House of Representatives, in which he served for twelve years. Elected to the United States House of Representatives in 1846, Lincoln promoted rapid modernization of the economy through banks, tariffs, and railroads. Because he had originally agreed not to run for a second term in Congress, and because his opposition to the Mexican–American War was unpopular among Illinois voters, Lincoln returned to Springfield and resumed his successful law practice. Reentering politics in 1854, he became a leader in building the new Republican Party, which had a statewide majority in Illinois. In 1858, while taking part in a series of highly publicized debates with his opponent and rival, Democrat Stephen A. Douglas, Lincoln spoke out against the expansion of slavery, but lost the U.S. Senate race to Douglas.\nIn 1860, Lincoln secured the Republican Party presidential nomination as a moderate from a swing state. Though he gained very little support in the slaveholding states of the South, he swept the North and was elected president in 1860. Lincoln's victory prompted seven southern slave states to form the Confederate States of America before he moved into the White House - no compromise or reconciliation was found regarding slavery and secession. Subsequently, on April 12, 1861, a Confederate attack on Fort Sumter inspired the North to enthusiastically rally behind the Union. As the leader of the moderate faction of the Republican Party, Lincoln confronted Radical Republicans, who demanded harsher treatment of the South, War Democrats, who called for more compromise, anti-war Democrats (called Copperheads), who despised him, and irreconcilable secessionists, who plotted his assassination. Politically, Lincoln fought back by pitting his opponents against each other, by carefully planned political patronage, and by appealing to the American people with his powers of oratory. His Gettysburg Address became an iconic endorsement of the principles of nationalism, republicanism, equal rights, liberty, and democracy.\nLincoln initially concentrated on the military and political dimensions of the war. His primary goal was to reunite the nation. He suspended habeas corpus, leading to the controversial ex parte Merryman decision, and he averted potential British intervention in the war by defusing the Trent Affair in late 1861. Lincoln closely supervised the war effort, especially the selection of top generals, including his most successful general, Ulysses S. Grant. He also made major decisions on Union war strategy, including a naval blockade that shut down the South's normal trade, moves to take control of Kentucky and Tennessee, and using gunboats to gain control of the southern river system. Lincoln tried repeatedly to capture the Confederate capital at Richmond; each time a general failed, Lincoln substituted another, until finally Grant succeeded. As the war progressed, his complex moves toward ending slavery included the Emancipation Proclamation of 1863; Lincoln used the U.S. Army to protect escaped slaves, encouraged the border states to outlaw slavery, and pushed through Congress the Thirteenth Amendment to the United States Constitution, which permanently outlawed slavery.\nAn exceptionally astute politician deeply involved with power issues in each state, Lincoln reached out to the War Democrats and managed his own re-election campaign in the 1864 presidential election. Anticipating the war's conclusion, Lincoln pushed a moderate view of Reconstruction, seeking to reunite the nation speedily through a policy of generous reconciliation in the face of lingering and bitter divisiveness. On April 14, 1865, five days after the April 9th surrender of Confederate commanding general Robert E. Lee, Lincoln was assassinated by John Wilkes Booth, a Confederate sympathizer.\nLincoln has been consistently ranked both by scholars and the public as one of the three greatest U.S. presidents.", "party": "Republican", "president": "Abraham Lincoln", "birth_year": 1809, "took_office": "1861-03-04"}, {"left_office": "1869-03-04", "img": "https://upload.wikimedia.org/wikipedia/en/a/a4/Flag_of_the_United_States.svg", "death_year": 1875, "number": 17, "summary": "Andrew Johnson (December 29, 1808 –  July 31, 1875) was the 17th President of the United States, serving from 1865 to 1869. Johnson became president as he was vice president at the time of the assassination of Abraham Lincoln. A Democrat who ran with Lincoln on the National Union ticket, Johnson came to office as the Civil War concluded. The new president favored quick restoration of the seceded states to the Union. His plans did not give protection to the former slaves, and he came into conflict with the Republican-dominated Congress, culminating in his impeachment by the House of Representatives. The first American president to be impeached, he was acquitted in the Senate by one vote.\nJohnson was born in poverty in Raleigh, North Carolina. Apprenticed as a tailor, he worked in several frontier towns before settling in Greeneville, Tennessee. He served as alderman and mayor there before being elected to the Tennessee House of Representatives in 1835. After brief service in the Tennessee Senate, Johnson was elected to the federal House of Representatives in 1843, where he served five two-year terms. He became Governor of Tennessee for four years, and was elected by the legislature to the Senate in 1857. In his congressional service, he sought passage of the Homestead Bill, which was enacted soon after he left his Senate seat in 1862.\nAs Southern slave states, including Tennessee, seceded to form the Confederate States of America, Johnson remained firmly with the Union. He was the only sitting senator from a Confederate state who did not resign his seat upon learning of his state's secession. In 1862, Lincoln appointed him as military governor of Tennessee after most of it had been retaken. In 1864, Johnson, as a War Democrat and Southern Unionist, was a logical choice as running mate for Lincoln, who wished to send a message of national unity in his re-election campaign; their ticket easily won. When Johnson was sworn in as vice president in March 1865, he gave a rambling speech. He later secluded himself to avoid public ridicule. Six weeks later, the assassination of Lincoln made him president.\nJohnson implemented his own form of Presidential Reconstruction – a series of proclamations directing the seceded states to hold conventions and elections to re-form their civil governments. When Southern states returned many of their old leaders, and passed Black Codes to deprive the freedmen of many civil liberties, Congressional Republicans refused to seat legislators from those states and advanced legislation to overrule the Southern actions. Johnson vetoed their bills, and Congressional Republicans overrode him, setting a pattern for the remainder of his presidency. Johnson opposed the Fourteenth Amendment, which gave citizenship to former slaves. In 1866, Johnson went on an unprecedented national tour promoting his executive policies, seeking to destroy his Republican opponents. As the conflict between the branches of government grew, Congress passed the Tenure of Office Act, restricting Johnson's ability to fire Cabinet officials. When he persisted in trying to dismiss Secretary of War Edwin Stanton, he was impeached by the House of Representatives, and narrowly avoided conviction in the Senate and removal from office. Returning to Tennessee after his presidency, Johnson sought political vindication, and gained it in his eyes when he was elected to the Senate again in 1875 (the only former president to serve there), just months before his death. Many historians rank Johnson among the worst American presidents for his strong opposition to federally guaranteed rights for African Americans, while some historians admire Johnson for his strict constitutionalism.", "party": "Democratic", "president": "Andrew Johnson", "birth_year": 1808, "took_office": "1865-04-15"}, {"left_office": "1877-03-04", "img": "https://upload.wikimedia.org/wikipedia/commons/0/02/US_Army_General_insignia_%281866%29.svg", "death_year": 1885, "number": 18, "summary": "Ulysses S. Grant (born Hiram Ulysses Grant; April 27, 1822 – July 23, 1885) was the 18th President of the United States (1869–77). As Commanding General of the United States Army (1864–69), Grant worked closely with President Abraham Lincoln to lead the Union Army to victory over the Confederacy in the American Civil War. He implemented Congressional Reconstruction, often at odds with Lincoln's successor, Andrew Johnson. Twice elected president, Grant led the Republicans in their effort to remove the vestiges of Confederate nationalism and slavery, protect African-American citizenship, and support economic prosperity nationwide. His presidency has often come under criticism for protecting corrupt associates and in his second term leading the nation into a severe economic depression.\nGrant graduated in 1843 from the U.S. Military Academy at West Point, served in the Mexican–American War and initially retired in 1854. He struggled financially in civilian life. When the Civil War began in 1861, he rejoined the U.S. Army. In 1862, Grant took control of Kentucky and most of Tennessee, and led Union forces to victory in the Battle of Shiloh, earning a reputation as an aggressive commander. He incorporated displaced African American slaves into the Union war effort. In July 1863, after a series of coordinated battles, Grant defeated Confederate armies and seized Vicksburg, giving the Union control of the Mississippi River and dividing the Confederacy in two. After his victories in the Chattanooga Campaign, Lincoln promoted him to lieutenant-general and Commanding General of the United States Army in March 1864. Grant confronted Robert E. Lee in a series of bloody battles, trapping Lee's army in their defense of Richmond. Grant coordinated a series of devastating campaigns in other theaters. In April 1865, Lee surrendered to Grant at Appomattox, effectively ending the war. Historians have hailed Grant's military genius, and his strategies are featured in military history textbooks, but a minority contend that he won by brute force rather than superior strategy.\nAfter the Civil War, Grant led the army's supervision of Reconstruction in the former Confederate states. Elected president in 1868 and reelected in 1872, Grant stabilized the nation during the turbulent Reconstruction period, prosecuted the Ku Klux Klan, and enforced civil and voting rights laws using the army and the Department of Justice. He used the army to build the Republican Party in the South, based on black voters, Northern newcomers (\"carpetbaggers\"), and native Southern white supporters (\"scalawags\"). After the disenfranchisement of some former Confederates, Republicans gained majorities and African Americans were elected to Congress and high state offices. In his second term, the Republican coalitions in the South splintered and were defeated one by one as redeemers (conservative whites) regained control using coercion and violence. Grant's Indian peace policy initially reduced frontier violence, but is best known for the Great Sioux War of 1876, where George Custer and his regiment were killed at the Battle of the Little Bighorn. Grant responded to charges of corruption in executive offices more than any other 19th Century president. He appointed the first Civil Service Commission and signed legislation ending the corrupt moiety system.\nIn foreign policy, Grant sought to increase American trade and influence, while remaining at peace with the world. His administration successfully resolved the Alabama Claims by the Treaty of Washington with Great Britain, ending wartime tensions. Grant avoided war with Spain over the Virginius Affair, but Congress rejected his attempted annexation of the Dominican Republic. In trade policy, Grant's administration implemented a gold standard and sought to strengthen the dollar. Corruption charges escalated during his second term, while his response to the Panic of 1873 proved ineffective nationally in halting the five-year industrial depression that produced high unemployment, low prices, low profits, and bankruptcies. Grant left office in 1877 and embarked on a widely praised world tour lasting over two years.\nIn 1880, Grant was unsuccessful in obtaining a Republican presidential nomination for a third term. Facing severe investment reversals and dying of throat cancer, he completed his memoirs, which proved a major critical and financial success. His death in 1885 prompted an outpouring of national unity. 20th century historical evaluations were negative about his presidency before recovering somewhat beginning in the 1980s. Scholars rank his presidency below the average of other presidents. Grant's management of Reconstruction is still considered controversial today. His critics take a negative view of his defense of corrupt associates, deflationary financial policies, and his failed Dominican Republic annexation treaty, while admirers emphasize his concern for Native Americans, his enforcement of civil and voting rights for African Americans, and his administration's successful Treaty of Washington.", "party": "Republican", "president": "Ulysses S. Grant", "birth_year": 1822, "took_office": "1869-03-04"}, {"left_office": "1881-03-04", "img": "https://upload.wikimedia.org/wikipedia/commons/8/80/HAYES%2C_Rutherford_B-President_%28BEP_engraved_portrait%29.jpg", "death_year": 1893, "number": 19, "summary": "Rutherford Birchard Hayes (October 4, 1822 – January 17, 1893) was the 19th President of the United States (1877–81). As president, he oversaw the end of Reconstruction, began the efforts that led to civil service reform, and attempted to reconcile the divisions left over from the Civil War and Reconstruction.\nHayes, an attorney in Ohio, was city solicitor of Cincinnati from 1858 to 1861. When the Civil War began, he left a fledgling political career to join the Union Army as an officer. Hayes was wounded five times, most seriously at the Battle of South Mountain; he earned a reputation for bravery in combat and was promoted to the rank of major general. After the war, he served in the U.S. Congress from 1865 to 1867 as a Republican. Hayes left Congress to run for Governor of Ohio and was elected to two consecutive terms, from 1868 to 1872, and then to a third term, from 1876 to 1877.\nIn 1876, Hayes was elected president in one of the most contentious elections in national history. He lost the popular vote to Democrat Samuel J. Tilden but he won an intensely disputed electoral college vote after a Congressional commission awarded him twenty contested electoral votes. The result was the Compromise of 1877, in which the Democrats acquiesced to Hayes's election and Hayes ended all U.S. military involvement in Southern politics.\nHayes believed in meritocratic government, equal treatment without regard to race, and improvement through education. He ordered federal troops to crush the Great Railroad Strike of 1877. He implemented modest civil service reforms that laid the groundwork for further reform in the 1880s and 1890s. He vetoed the Bland–Allison Act, which would have put silver money into circulation and raised prices, insisting that maintenance of the gold standard was essential to economic recovery. His policy toward Western Indians anticipated the assimilationist program of the Dawes Act of 1887.\nHayes kept his pledge not to run for re-election, retired to his home in Ohio, and became an advocate of social and educational reform. Biographer Ari Hoogenboom says his greatest achievement was to restore popular faith in the presidency and to reverse the deterioration of executive power that had set in after Abraham Lincoln's death. Although supporters have praised his commitment to civil service reform and defense of civil rights, Hayes is generally listed among the bottom half in historians' rankings of U.S. presidents.", "party": "Republican", "president": "Rutherford B. Hayes", "birth_year": 1822, "took_office": "1877-03-04"}, {"left_office": "1881-09-19", "img": "https://upload.wikimedia.org/wikipedia/en/a/a4/Flag_of_the_United_States.svg", "death_year": 1881, "number": 20, "summary": "James Abram Garfield (November 19, 1831 – September 19, 1881) was the 20th President of the United States, serving from March 4, 1881, until his assassination later that year. Garfield had served nine terms in the House of Representatives, and had been elected to the Senate before his candidacy for the White House, though he declined the senatorship once he was president-elect. He is the only sitting House member to be elected president.\nGarfield was raised in humble circumstances on an Ohio farm by his widowed mother. He worked at various jobs, including on a canal boat, in his youth. Beginning at age 17, he attended several Ohio schools, then studied at Williams College in Williamstown, Massachusetts, from which he graduated in 1856. A year later, Garfield entered politics as a Republican. He married Lucretia Rudolph in 1858, and served as a member of the Ohio State Senate (1859–1861). Garfield opposed Confederate secession, served as a major general in the Union Army during the American Civil War, and fought in the battles of Middle Creek, Shiloh, and Chickamauga. He was first elected to Congress in 1862 to represent Ohio's 19th District. Throughout Garfield's extended congressional service after the Civil War, he firmly supported the gold standard and gained a reputation as a skilled orator. Garfield initially agreed with Radical Republican views regarding Reconstruction, but later favored a moderate approach for civil rights enforcement for freedmen.\nAt the 1880 Republican National Convention, Senator-elect Garfield attended as campaign manager for Secretary of the Treasury John Sherman, and gave the presidential nomination speech for him. When neither Sherman nor his rivals – Ulysses S. Grant and James G. Blaine – could get enough votes to secure the nomination, delegates chose Garfield as a compromise on the 36th ballot. In the 1880 presidential election, Garfield conducted a low-key front porch campaign, and narrowly defeated Democrat Winfield Scott Hancock.\nGarfield's accomplishments as president included a resurgence of presidential authority against senatorial courtesy in executive appointments, energizing American naval power, and purging corruption in the Post Office, all during his extremely short time in office. Garfield made notable diplomatic and judiciary appointments, including a U.S. Supreme Court justice. He enhanced the powers of the presidency when he defied the powerful New York senator Roscoe Conkling by appointing William H. Robertson to the lucrative post of Collector of the Port of New York, starting a fracas that ended with Robertson's confirmation and Conkling's resignation from the Senate. Garfield advocated agricultural technology, an educated electorate, and civil rights for African Americans. He also proposed substantial civil service reform, eventually passed by Congress in 1883 and signed into law by his successor, Chester A. Arthur, as the Pendleton Civil Service Reform Act. With his term cut short by his death after only 200 days, and much of it spent in ill health trying to recover from the attack, Garfield is little-remembered in the American cultural memory other than for his assassination; historians often forgo listing him in rankings of U.S. presidents due to the short length of his presidency.", "party": "Republican", "president": "James A. Garfield", "birth_year": 1831, "took_office": "1881-03-04"}, {"left_office": "1885-03-04", "img": "https://upload.wikimedia.org/wikipedia/commons/1/1d/ARTHUR%2C_Chester_A-President_%28BEP_engraved_portrait%29.jpg", "death_year": 1886, "number": 21, "summary": "Chester Alan Arthur (October 5, 1829 – November 18, 1886) was an American attorney and politician who served as the 21st President of the United States (1881–85); he succeeded James A. Garfield upon the latter's assassination. At the outset, Arthur struggled to overcome a slightly negative reputation, which stemmed from his early career in politics as part of New York's Republican political machine. He succeeded by embracing the cause of civil service reform. His advocacy for, and subsequent enforcement of, the Pendleton Civil Service Reform Act was the centerpiece of his administration.\nArthur was born in Fairfield, Vermont, grew up in upstate New York, and practiced law in New York City. He served as quartermaster general in the New York Militia during the American Civil War. Following the war, he devoted more time to Republican politics and quickly rose in the political machine run by New York Senator Roscoe Conkling. Appointed by President Ulysses S. Grant to the lucrative and politically powerful post of Collector of the Port of New York in 1871, Arthur was an important supporter of Conkling and the Stalwart faction of the Republican Party. In 1878 the new president, Rutherford B. Hayes, fired Arthur as part of a plan to reform the federal patronage system in New York. When Garfield won the Republican nomination for president in 1880, Arthur, an eastern Stalwart, was nominated for vice president to balance the ticket.\nAfter just half a year as vice president, Arthur found himself in the executive mansion due to the assassination of his predecessor. To the surprise of reformers, Arthur took up the cause of reform, though it had once led to his expulsion from office. He signed the Pendleton Act into law and strongly enforced its provisions. He gained praise for his veto of a Rivers and Harbors Act that would have appropriated federal funds in a manner he thought excessive. He presided over the rebirth of the United States Navy, but was criticized for failing to alleviate the federal budget surplus, which had been accumulating since the end of the Civil War.\nSuffering from poor health, Arthur made only a limited effort to secure the Republican Party's nomination in 1884; he retired at the close of his term. Journalist Alexander McClure later wrote, \"No man ever entered the Presidency so profoundly and widely distrusted as Chester Alan Arthur, and no one ever retired ... more generally respected, alike by political friend and foe.\" Although his failing health and political temperament combined to make his administration less active than a modern presidency, he earned praise among contemporaries for his solid performance in office. The New York World summed up Arthur's presidency at his death in 1886: \"No duty was neglected in his administration, and no adventurous project alarmed the nation.\" Mark Twain wrote of him, \"[I]t would be hard indeed to better President Arthur's administration.\" Over the 20th and 21st centuries, however, Arthur's reputation mostly faded among the public.", "party": "Republican", "president": "Chester A. Arthur", "birth_year": 1829, "took_office": "1881-09-19"}, {"left_office": "1889-03-04", "img": "https://upload.wikimedia.org/wikipedia/commons/f/f0/US-%241000-GC-1934-Fr.2409.jpg", "death_year": 1908, "number": 22, "summary": "Stephen Grover Cleveland (March 18, 1837 – June 24, 1908) was an American politician and lawyer who served as the 22nd and 24th President of the United States. He was the winner of the popular vote for president three times – in 1884, 1888, and 1892 – and was one of the three Democrats (with Andrew Johnson and Woodrow Wilson) to serve as president during the era of Republican political domination dating from 1861 to 1933. He is the only President in American history to serve two non-consecutive terms in office.\nCleveland was the leader of the pro-business Bourbon Democrats who opposed high tariffs, Free Silver, inflation, imperialism, and subsidies to business, farmers, or veterans. His crusade for political reform and fiscal conservatism made him an icon for American conservatives of the era. Cleveland won praise for his honesty, self-reliance, integrity, and commitment to the principles of classical liberalism. He relentlessly fought political corruption, patronage, and bossism. As a reformer Cleveland had such prestige that the like-minded wing of the Republican Party, called \"Mugwumps\", largely bolted the GOP presidential ticket and swung to his support in the 1884 election.\nAs his second administration began, disaster hit the nation when the Panic of 1893 produced a severe national depression, which Cleveland was unable to reverse. It ruined his Democratic Party, opening the way for a Republican landslide in 1894 and for the agrarian and silverite seizure of the Democratic Party in 1896. The result was a political realignment that ended the Third Party System and launched the Fourth Party System and the Progressive Era.\nCleveland was a formidable policymaker, and he also drew corresponding criticism. His intervention in the Pullman Strike of 1894 to keep the railroads moving angered labor unions nationwide in addition to the party in Illinois; his support of the gold standard and opposition to Free Silver alienated the agrarian wing of the Democratic Party. Critics complained that Cleveland had little imagination and seemed overwhelmed by the nation's economic disasters—depressions and strikes—in his second term. Even so, his reputation for probity and good character survived the troubles of his second term. Biographer Allan Nevins wrote: \"[I]n Grover Cleveland the greatness lies in typical rather than unusual qualities. He had no endowments that thousands of men do not have. He possessed honesty, courage, firmness, independence, and common sense. But he possessed them to a degree other men do not.\" Today, Cleveland is considered by most historians to have been a successful leader, generally ranked among the second tier of American presidents.", "party": "Democratic", "president": "Grover Cleveland", "birth_year": 1837, "took_office": "1885-03-04"}, {"left_office": "1893-03-04", "img": "https://upload.wikimedia.org/wikipedia/commons/8/83/USS_Texas2.jpg", "death_year": 1901, "number": 23, "summary": "Benjamin Harrison (August 20, 1833 – March 13, 1901) was an American politician and lawyer who served as the 23rd President of the United States from 1889 to 1893; he was the grandson of the ninth president, William Henry Harrison. Before ascending to the presidency, Harrison established himself as a prominent local attorney, Presbyterian church leader and politician in Indianapolis, Indiana. During the American Civil War, he served the Union as a colonel and on February 14, 1865 was confirmed by the U.S. Senate as a brevet brigadier general of volunteers to rank from January 23, 1865. After the war, he unsuccessfully ran for the governorship of Indiana. He was later elected to the U.S. Senate by the Indiana legislature.\nA Republican, Harrison was elected to the presidency in 1888, defeating the Democratic incumbent Grover Cleveland. Hallmarks of his administration included unprecedented economic legislation, including the McKinley Tariff, which imposed historic protective trade rates, and the Sherman Antitrust Act; Harrison facilitated the creation of the National Forests through an amendment to the Land Revision Act of 1891. He also substantially strengthened and modernized the Navy, and conducted an active foreign policy. He proposed, in vain, federal education funding as well as voting rights enforcement for African Americans during his administration.\nDue in large part to surplus revenues from the tariffs, federal spending reached one billion dollars for the first time during his term. The spending issue in part led to the defeat of the Republicans in the 1890 mid-term elections. Harrison was defeated by Cleveland in his bid for re-election in 1892, due to the growing unpopularity of the high tariff and high federal spending. He then returned to private life in Indianapolis but later represented the Republic of Venezuela in an international case against the United Kingdom. In 1900, he traveled to Europe as part of the case and, after a brief stay, returned to Indianapolis. He died the following year of complications from influenza. Although many have praised Harrison's commitment to African Americans' voting rights, scholars and historians generally regard his administration as below-average, and rank him in the bottom half among U.S. presidents. Historians, however, have not questioned Harrison's commitment to personal and official integrity.", "party": "Republican", "president": "Benjamin Harrison", "birth_year": 1833, "took_office": "1889-03-04"}, {"left_office": "1897-03-04", "img": "https://upload.wikimedia.org/wikipedia/commons/f/f0/US-%241000-GC-1934-Fr.2409.jpg", "death_year": 1908, "number": 24, "summary": "Stephen Grover Cleveland (March 18, 1837 – June 24, 1908) was an American politician and lawyer who served as the 22nd and 24th President of the United States. He was the winner of the popular vote for president three times – in 1884, 1888, and 1892 – and was one of the three Democrats (with Andrew Johnson and Woodrow Wilson) to serve as president during the era of Republican political domination dating from 1861 to 1933. He is the only President in American history to serve two non-consecutive terms in office.\nCleveland was the leader of the pro-business Bourbon Democrats who opposed high tariffs, Free Silver, inflation, imperialism, and subsidies to business, farmers, or veterans. His crusade for political reform and fiscal conservatism made him an icon for American conservatives of the era. Cleveland won praise for his honesty, self-reliance, integrity, and commitment to the principles of classical liberalism. He relentlessly fought political corruption, patronage, and bossism. As a reformer Cleveland had such prestige that the like-minded wing of the Republican Party, called \"Mugwumps\", largely bolted the GOP presidential ticket and swung to his support in the 1884 election.\nAs his second administration began, disaster hit the nation when the Panic of 1893 produced a severe national depression, which Cleveland was unable to reverse. It ruined his Democratic Party, opening the way for a Republican landslide in 1894 and for the agrarian and silverite seizure of the Democratic Party in 1896. The result was a political realignment that ended the Third Party System and launched the Fourth Party System and the Progressive Era.\nCleveland was a formidable policymaker, and he also drew corresponding criticism. His intervention in the Pullman Strike of 1894 to keep the railroads moving angered labor unions nationwide in addition to the party in Illinois; his support of the gold standard and opposition to Free Silver alienated the agrarian wing of the Democratic Party. Critics complained that Cleveland had little imagination and seemed overwhelmed by the nation's economic disasters—depressions and strikes—in his second term. Even so, his reputation for probity and good character survived the troubles of his second term. Biographer Allan Nevins wrote: \"[I]n Grover Cleveland the greatness lies in typical rather than unusual qualities. He had no endowments that thousands of men do not have. He possessed honesty, courage, firmness, independence, and common sense. But he possessed them to a degree other men do not.\" Today, Cleveland is considered by most historians to have been a successful leader, generally ranked among the second tier of American presidents.", "party": "Democratic", "president": "Grover Cleveland", "birth_year": 1837, "took_office": "1893-03-04"}, {"left_office": "1901-09-14", "img": "https://upload.wikimedia.org/wikipedia/commons/5/54/Union_army_maj_rank_insignia.jpg", "death_year": 1901, "number": 25, "summary": "William McKinley (January 29, 1843 – September 14, 1901) was an American politician and lawyer who served as the 25th President of the United States from March 4, 1897, until his assassination in September 1901, six months into his second term. McKinley led the nation to victory in the Spanish–American War, raised protective tariffs to promote American industry, and maintained the nation on the gold standard in a rejection of inflationary proposals.\nMcKinley was the last president to have served in the American Civil War, beginning as a private in the Union Army and ending as a brevet major. After the war, he settled in Canton, Ohio, where he practiced law and married Ida Saxton. In 1876, he was elected to Congress, where he became the Republican Party's expert on the protective tariff, which he promised would bring prosperity. His 1890 McKinley Tariff was highly controversial; which together with a Democratic redistricting aimed at gerrymandering him out of office, led to his defeat in the Democratic landslide of 1890. He was elected Ohio's governor in 1891 and 1893, steering a moderate course between capital and labor interests. With the aid of his close adviser Mark Hanna, he secured the Republican nomination for president in 1896, amid a deep economic depression. He defeated his Democratic rival, William Jennings Bryan, after a front-porch campaign in which he advocated \"sound money\" (the gold standard unless altered by international agreement) and promised that high tariffs would restore prosperity.\nRapid economic growth marked McKinley's presidency. He promoted the 1897 Dingley Tariff to protect manufacturers and factory workers from foreign competition, and in 1900, he secured the passage of the Gold Standard Act. McKinley hoped to persuade Spain to grant independence to rebellious Cuba without conflict, but when negotiation failed, he led the nation in the Spanish–American War of 1898; the U.S. victory was quick and decisive. As part of the peace settlement, Spain turned over to the United States its main overseas colonies of Puerto Rico, Guam, and the Philippines; Cuba was promised independence, but at that time remained under the control of the U.S. Army. The United States annexed the independent Republic of Hawaii in 1898 and it became a U.S. territory.\nHistorians regard McKinley's 1896 victory as a realigning election, in which the political stalemate of the post–Civil War era gave way to the Republican-dominated Fourth Party System, which began with the Progressive Era. McKinley defeated Bryan again in the 1900 presidential election, in a campaign focused on imperialism, protectionism, and free silver. However, his legacy was quickly cut short when he was shot on September 6, 1901 by Leon Czolgosz, a second-generation Polish-American with anarchist leanings; McKinley died eight days later, and was succeeded by Vice President Theodore Roosevelt. As an innovator of American interventionism and pro-business sentiment, McKinley's presidency is generally considered above average, though his universally positive public perception was soon overshadowed by Roosevelt.", "party": "Republican", "president": "William McKinley", "birth_year": 1843, "took_office": "1897-03-04"}, {"left_office": "1909-03-04", "img": "https://upload.wikimedia.org/wikipedia/commons/7/75/Teddy02.jpg", "death_year": 1919, "number": 26, "summary": "Theodore Roosevelt Jr. (/ˈroʊzəvɛlt/ ROH-zə-velt; October 27, 1858 – January 6, 1919) was an American statesman, author, explorer, soldier, naturalist, and reformer who served as the 26th President of the United States from 1901 to 1909. As a leader of the Republican Party during this time, he became a driving force for the Progressive Era in the United States in the early 20th century.\nBorn a sickly child with debilitating asthma, Roosevelt successfully overcame his health problems by embracing a strenuous lifestyle. He integrated his exuberant personality, vast range of interests, and world-famous achievements into a \"cowboy\" persona defined by robust masculinity. Home-schooled, he began a lifelong naturalist avocation before attending Harvard College. His first of many books, The Naval War of 1812 (1882), established his reputation as both a learned historian and as a popular writer. Upon entering politics, he became the leader of the reform faction of Republicans in New York's state legislature. Following the deaths of his wife and mother, he took time to grieve by escaping to the wilderness of the American West and operating a cattle ranch in the Dakotas for a time, before returning East to run unsuccessfully for Mayor of New York City in 1886. He served as Assistant Secretary of the Navy under William McKinley, resigning after one year to serve with the Rough Riders, where he gained national fame for courage during the Spanish–American War. Returning a war hero, he was elected governor of New York in 1898. The state party leadership distrusted him, so they took the lead in moving him to the prestigious but powerless role of vice president as McKinley's running mate in the election of 1900. Roosevelt campaigned vigorously across the country, helping McKinley's re-election in a landslide victory based on a platform of peace, prosperity, and conservatism.\nFollowing the assassination of President McKinley in September 1901, Roosevelt, at age 42, succeeded to the office, becoming the youngest United States President in history. Leading his party and country into the Progressive Era, he championed his \"Square Deal\" domestic policies, promising the average citizen fairness, breaking of trusts, regulation of railroads, and pure food and drugs. Making conservation a top priority, he established a myriad of new national parks, forests, and monuments intended to preserve the nation's natural resources. In foreign policy, he focused on Central America, where he began construction of the Panama Canal. He greatly expanded the United States Navy, and sent the Great White Fleet on a world tour to project the United States' naval power around the globe. His successful efforts to end the Russo-Japanese War won him the 1906 Nobel Peace Prize.\nElected in 1904 to a full term, Roosevelt continued to promote progressive policies, but many of his efforts and much of his legislative agenda were eventually blocked in Congress. Roosevelt successfully groomed his close friend, William Howard Taft, to succeed him in the presidency. After leaving office, Roosevelt went on safari in Africa and toured Europe. Returning to the USA, he became frustrated with Taft's approach as his successor. He tried but failed to win the presidential nomination in 1912. Roosevelt founded his own party, the Progressive, so-called \"Bull Moose\" Party, and called for wide-ranging progressive reforms. The split among Republicans enabled the Democrats to win both the White House and a majority in the Congress in 1912. The Democrats in the South had also gained power by having disenfranchised most blacks (and Republicans) from the political system from 1890 to 1908, fatally weakening the Republican Party across the region, and creating a Solid South dominated by their party alone. Republicans aligned with Taft nationally would control the Republican Party for decades.\nFrustrated at home, Roosevelt led a two-year expedition in the Amazon Basin, nearly dying of tropical disease. During World War I, he opposed President Woodrow Wilson for keeping the U.S. out of the war against Germany, and offered his military services, which were never summoned. Although planning to run again for president in 1920, Roosevelt suffered deteriorating health and died in early 1919. Roosevelt has consistently been ranked by scholars as one of the greatest U.S. presidents. Historians admire Roosevelt for rooting out corruption in his administration, but are critical of his 1909 libel lawsuits against the World and the News. His face was carved into Mount Rushmore alongside those of George Washington, Thomas Jefferson, and Abraham Lincoln.\n\n", "party": "Republican", "president": "Theodore Roosevelt", "birth_year": 1858, "took_office": "1901-09-14"}, {"left_office": "1913-03-04", "img": "https://upload.wikimedia.org/wikipedia/en/6/69/P_vip.svg", "death_year": 1930, "number": 27, "summary": "William Howard Taft (September 15, 1857 – March 8, 1930) served as the 27th President of the United States (1909–1913) and as the 10th Chief Justice of the United States (1921–1930), the only person to have held both offices. Taft was elected president in 1908, the chosen successor of Theodore Roosevelt, but was defeated for re-election by Woodrow Wilson in 1912 after Roosevelt split the Republican vote by running as a third-party candidate. In 1921, President Warren G. Harding appointed Taft chief justice, a position in which he served until a month before his death.\nTaft was born in Cincinnati in 1857. His father Alphonso Taft was a U.S. Attorney General and Secretary of War. William Taft attended Yale and was a member of Skull and Bones secret society like his father, and after becoming a lawyer was appointed a judge while still in his twenties. He continued a rapid rise, being named Solicitor General and as a judge of the Sixth Circuit Court of Appeals. President William McKinley appointed Taft civilian governor of the Philippines. In 1904, Roosevelt made him Secretary of War and he became Roosevelt's hand-picked successor. Despite his personal ambition to become Chief Justice, Taft declined repeated offers of appointment to the Supreme Court of the United States, believing his political work more important.\nWith Roosevelt's help, Taft had little opposition for the Republican nomination for president in 1908, and easily defeated William Jennings Bryan for the presidency that November. In the White House, he focused on the Far East more than European affairs, and repeatedly intervened to prop up or remove Latin American governments. Taft sought reductions to trade tariffs, then a major source of governmental income, but the resulting bill was heavily influenced by special interests. His administration was filled with conflict between the conservative wing of the Republican Party, with which Taft often sympathized, and the progressive wing, toward which Roosevelt moved more and more. Controversies over conservation and over antitrust cases filed by the Taft administration served to further separate the two men. Roosevelt challenged Taft for renomination in 1912. Taft used his control of the party machinery to gain a bare majority of delegates, and Roosevelt bolted the party. The split left Taft with little chance of re-election, and in Wilson's victory won only Utah and Vermont.\nAfter leaving office, Taft returned to Yale as a professor, continuing his political activity and working against war through the League to Enforce Peace. In 1921, President Harding appointed Taft chief justice, an office he had long sought. Chief Justice Taft was a conservative on business issues, but under him, there were advances in individual rights. In poor health, he resigned in February 1930. After his death the next month, he was buried at Arlington National Cemetery, the first president and first Supreme Court justice to be interred there. Taft is generally listed near the middle in historians' rankings of U.S. presidents.", "party": "Republican", "president": "William Howard Taft", "birth_year": 1857, "took_office": "1909-03-04"}, {"left_office": "1921-03-04", "img": "https://upload.wikimedia.org/wikipedia/commons/d/d4/Woodrow_Wilson_1902_cph.3b11773.jpg", "death_year": 1924, "number": 28, "summary": "Thomas Woodrow Wilson (December 28, 1856 – February 3, 1924) was an American politician and academic who served as the 28th President of the United States from 1913 to 1921. Born in Staunton, Virginia, he spent his early years in Augusta, Georgia and Columbia, South Carolina. Wilson earned a PhD in political science at Johns Hopkins University, and served as a professor and scholar at various institutions before being chosen as President of Princeton University, a position he held from 1902 to 1910. In the election of 1910, he was the gubernatorial candidate of New Jersey's Democratic Party, and was elected the 34th Governor of New Jersey, serving from 1911 to 1913. Running for president in 1912, Wilson benefited from a split in the Republican Party, which enabled his plurality of just over forty percent to win him a large electoral college margin. He was the first Southerner elected as president since Zachary Taylor in 1848, and Wilson was a leading force in the Progressive Movement, bolstered by his Democratic Party's winning control of both the White House and Congress in 1912.\nIn office, Wilson reintroduced the spoken State of the Union, which had been out of use since 1801. Leading the Congress, now in Democratic hands, he oversaw the passage of progressive legislative policies unparalleled until the New Deal in 1933. Included among these were the Federal Reserve Act, Federal Trade Commission Act, the Clayton Antitrust Act, and the Federal Farm Loan Act. Having taken office one month after ratification of the Sixteenth Amendment, Wilson called a special session of Congress, whose work culminated in the Revenue Act of 1913, reintroducing an income tax and lowering tariffs. Through passage of the Adamson Act, imposing an 8-hour workday for railroads, he averted a railroad strike and an ensuing economic crisis. Upon the outbreak of World War I in 1914, Wilson maintained a policy of neutrality, while pursuing a more aggressive policy in dealing with Mexico's civil war.\nWilson faced former New York Governor Charles Evans Hughes in the presidential election of 1916. By a narrow margin, he became the first Democrat since Andrew Jackson elected to two consecutive terms. Wilson's second term was dominated by American entry into World War I. In April 1917, when Germany resumed unrestricted submarine warfare, Wilson asked Congress to declare war in order to make \"the world safe for democracy.\" The United States conducted military operations alongside the Allies, although without a formal alliance. During the war, Wilson focused on diplomacy and financial considerations, leaving military strategy to the generals, especially General John J. Pershing. Loaning billions of dollars to Britain, France, and other Allies, the United States aided their finance of the war effort. Through the Selective Service Act, conscription sent 10,000 freshly trained soldiers to France per day by the summer of 1918. On the home front, he raised income taxes, borrowing billions of dollars through the public's purchase of Liberty Bonds. He set up the War Industries Board, promoted labor union cooperation, regulating agriculture and food production through the Lever Act, and granting to the Secretary of the Treasury, William McAdoo, direct control of the nation's railroad system.\nIn his 1915 State of the Union, Wilson asked Congress for what became the Espionage Act of 1917 and the Sedition Act of 1918, suppressing anti-draft activists. The crackdown was intensified by his Attorney General A. Mitchell Palmer to include expulsion of non-citizen radicals during the First Red Scare of 1919–1920. Following years of advocacy for suffrage on the state level, in 1918 he endorsed the Nineteenth Amendment, whose ratification in 1920 provided equal right to vote for women across the United States, over Southern opposition. Wilson staffed his government with Southern Democrats who believed in segregation. He gave department heads greater autonomy in their management. Early in 1918, he issued his principles for peace, the Fourteen Points, and in 1919, following armistice, he traveled to Paris, promoting the formation of a League of Nations, concluding the Treaty of Versailles. Following his return from Europe, Wilson embarked on a nationwide tour in 1919 to campaign for the treaty, suffering a severe stroke. The treaty was met with serious concern by Senate Republicans, and Wilson rejected a compromise effort led by Henry Cabot Lodge, leading to the Senate's rejection of the treaty. Due to his stroke, Wilson secluded himself in the White House, disability having diminished his power and influence. Forming a strategy for reelection, Wilson deadlocked the 1920 Democratic National Convention, but his bid for a third-term nomination was overlooked.\nA devoted Presbyterian, Wilson infused morality into his internationalism, an ideology now referred to as \"Wilsonian\"—an activist foreign policy calling on the nation to promote global democracy. For his sponsorship of the League of Nations, Wilson was awarded the 1919 Nobel Peace Prize, the second of three sitting presidents so honored.", "party": "Democratic", "president": "Woodrow Wilson", "birth_year": 1856, "took_office": "1913-03-04"}, {"left_office": "1923-08-02", "img": "https://upload.wikimedia.org/wikipedia/commons/0/03/Taft_Harding_Robert_Lincoln_1922.jpg", "death_year": 1923, "number": 29, "summary": "Warren Gamaliel Harding (November 2, 1865 – August 2, 1923) was the 29th President of the United States, serving from March 4, 1921, until his death. Harding died one of the most popular presidents in history, but the subsequent exposure of scandals that took place under him, such as Teapot Dome, eroded his popular regard, as did revelations of an affair by Nan Britton, one of his mistresses. In historical rankings of the U.S. presidents, Harding is often rated among the worst.\nHarding was born in Blooming Grove, Ohio. He lived in rural Ohio all his life, except when political service took him elsewhere. He settled in Marion when not yet 20 years old and bought The Marion Star, building it into a successful newspaper. In 1899, he was elected to the Ohio State Senate and, after four years there, successfully ran for lieutenant governor. He was defeated for governor in 1910, but was elected to the Senate in 1914.\nHarding ran for the Republican nomination for president in 1920, but he was considered an also-ran with little chance of success. The leading candidates, such as General Leonard Wood, could not gain a majority to secure the nomination, and the convention deadlocked. Harding's support gradually grew until he was nominated on the tenth ballot. He conducted a front porch campaign, remaining for the most part in Marion and allowing the people to come to him. He won in a landslide over Democrat James M. Cox and Socialist Party candidate Eugene Debs, running on a theme of return to normalcy and becoming the first sitting senator to be elected president.\nHarding appointed a number of well-regarded figures, including Andrew Mellon at the Treasury, Herbert Hoover at Commerce, and Charles Evans Hughes at the State Department. A major foreign policy achievement came with the Washington Naval Conference of 1921–1922, in which the world's major naval powers agreed on a naval limitations program that lasted a decade. Two members of his cabinet were implicated in corruption: Interior Secretary Albert Fall and Attorney General Harry Daugherty. The resulting scandals did not fully emerge until after Harding's death, nor did word of his extramarital affairs, but both greatly damaged his reputation. Harding died of a cerebral hemorrhage caused by heart disease in San Francisco while on a western speaking tour; he was succeeded by his vice president, Calvin Coolidge.", "party": "Republican", "president": "Warren G. Harding", "birth_year": 1865, "took_office": "1921-03-04"}, {"left_office": "1929-03-04", "img": "https://upload.wikimedia.org/wikipedia/en/6/69/P_vip.svg", "death_year": 1933, "number": 30, "summary": "John Calvin Coolidge Jr. (/ˈkuːlɪdʒ/; July 4, 1872 – January 5, 1933) was the 30th President of the United States (1923–29). A Republican lawyer from Vermont, Coolidge worked his way up the ladder of Massachusetts state politics, eventually becoming governor of that state. His response to the Boston Police Strike of 1919 thrust him into the national spotlight and gave him a reputation as a man of decisive action. Soon after, he was elected as the 29th vice president in 1920 and succeeded to the presidency upon the sudden death of Warren G. Harding in 1923. Elected in his own right in 1924, he gained a reputation as a small-government conservative, and also as a man who said very little, although having a rather dry sense of humor.\nCoolidge restored public confidence in the White House after the scandals of his predecessor's administration, and left office with considerable popularity. As a Coolidge biographer wrote, \"He embodied the spirit and hopes of the middle class, could interpret their longings and express their opinions. That he did represent the genius of the average is the most convincing proof of his strength.\" Coolidge's retirement was relatively short, as he died at the age of 60 in January 1933, less than two months before his direct successor, Herbert Hoover, left office.\nThough his reputation underwent a renaissance during the Ronald Reagan administration, modern assessments of Coolidge's presidency are divided. He is adulated among advocates of smaller government and laissez-faire; supporters of an active central government generally view him less favorably, while both sides praise his stalwart support of racial equality.", "party": "Republican", "president": "Calvin Coolidge", "birth_year": 1872, "took_office": "1923-08-02"}, {"left_office": "1933-03-04", "img": "https://upload.wikimedia.org/wikipedia/en/2/2c/Books_fishing_for_fun.jpg", "death_year": 1964, "number": 31, "summary": "Herbert Clark Hoover (August 10, 1874 – October 20, 1964) was an American politician who served as the 31st President of the United States from 1929 to 1933. A Republican, as Secretary of Commerce in the 1920s he introduced Progressive Era themes of efficiency in the business community and provided government support for standardization, efficiency and international trade. As president from 1929 to 1933, his ambitious programs were overwhelmed by the Great Depression, that seemed to get worse every year despite the increasingly large-scale interventions he made in the economy. He was defeated in a landslide in 1932 by Democrat Franklin D. Roosevelt, and spent the rest of his life as a conservative denouncing big government, liberalism and federal intervention in economic affairs, as Democrats repeatedly used his Depression record to attack conservatism and justify more regulation of the economy.\nHe was a professional mining engineer and was raised as a Quaker. Hoover served as head of the U.S. Food Administration during World War I, and became internationally known for humanitarian relief efforts in wartime Belgium. As the United States Secretary of Commerce in the 1920s he promoted partnerships between government and business. In the presidential election of 1928, Hoover easily won the Republican nomination, despite having no elected-office experience. Hoover is the most recent cabinet secretary to be elected President of the United States, as well as one of only two Presidents (along with William Howard Taft) who had neither been elected to a national political office or governorship, nor served as military generals. Although Hoover never raised the religious issue, some of his supporters did in mobilizing anti-Catholic sentiment against his opponent Al Smith.\nHoover, a globally experienced engineer, believed strongly in the Efficiency Movement, which held that the government and the economy were riddled with inefficiency and waste, and could be improved by experts who could identify the problems and solve them. He also believed in the importance of volunteerism and of the role of individuals in society and the economy. A rich man, Hoover donated all his federal paychecks to charity).\nWhen the Wall Street Crash of 1929 struck less than eight months after he took office, Hoover tried to combat the ensuing Great Depression in the United States with large-scale government public works projects such as the Hoover Dam, and calls on industry to keep wages high. He reluctantly approved the Smoot–Hawley Tariff, which sent foreign trade spiralling down. He believed it was essential to balance the budget despite falling tax revenue, so he raised the tax rates. The economy kept falling and unemployment rates rose to about 25%. This downward spiral, plus his support for prohibition policies that had lost favor, set the stage for Hoover's overwhelming defeat in 1932 by Democrat Franklin D. Roosevelt, who promised a New Deal.\nAfter Roosevelt assumed the Presidency in 1933, Hoover became a conservative spokesman for opposition to the domestic and foreign policies of the New Deal. In 1947, President Harry S. Truman appointed Hoover to head the Hoover Commission, intended to foster greater efficiency throughout the federal bureaucracy. Most historians agree that Hoover's defeat in the 1932 election was caused primarily by the downward economic spiral, although his strong support for prohibition was also significant. Hoover is usually ranked lower than average among U.S. Presidents.", "party": "Republican", "president": "Herbert Hoover", "birth_year": 1874, "took_office": "1929-03-04"}, {"left_office": "1945-04-12", "img": "https://upload.wikimedia.org/wikipedia/commons/2/28/Signing_Of_The_Social_Security_Act.jpg", "death_year": 1945, "number": 32, "summary": "Franklin Delano Roosevelt (/ˈroʊzəvəlt/, his own pronunciation, or /ˈroʊzəvɛlt/; January 30, 1882 – April 12, 1945), commonly known as FDR, was an American statesman and political leader who served as the 32nd President of the United States, from 1933 to 1945. A Democrat, he won a record four presidential elections and dominated his party after 1932 as a central figure in world events during the mid-20th century, leading the United States during a time of worldwide economic depression and total war. His program for relief, recovery and reform, known as the New Deal, involved a great expansion of the role of the federal government in the economy. As a dominant leader of the Democratic Party, he built the New Deal Coalition that brought together and united labor unions, big city machines, white ethnics, African Americans, and rural white Southerners in support of the party. The Coalition significantly realigned American politics after 1932, creating the Fifth Party System and defining American liberalism throughout the middle third of the 20th century.\nRoosevelt was born in 1882, to an old, prominent Dutch family from Dutchess County, New York. He attended the elite educational institutions of Groton School and Harvard College. At age 23 in 1905, he married Eleanor Roosevelt, with whom he had six children. He entered politics in 1910, serving in the New York State Senate, and then as Assistant Secretary of the Navy under President Woodrow Wilson. In 1920, Roosevelt ran for vice president with presidential candidate James M. Cox, but the Cox/Roosevelt ticket lost to the Republican ticket of Warren Harding and Calvin Coolidge. Roosevelt was stricken with debilitating polio in 1921, which cost him the use of his legs and put his future political career in jeopardy, but he attempted to recover from the illness, and founded the treatment center for people with polio in Warm Springs, Georgia. After returning to political life by placing Alfred E. Smith's name into nomination at the 1924 Democratic National Convention, Roosevelt, at Smith's behest, successfully ran for Governor of New York in 1928. In office from 1929 to 1933, he served as a reform governor promoting the enactment of programs to combat the Great Depression besetting the United States at the time.\nIn 1932, in the depths of the Great Depression, Roosevelt successfully defeated incumbent Republican president Herbert Hoover to win the presidency of the United States. Having been energized by his personal victory over his polio, FDR relied on his persistent optimism and activism to renew the national spirit. In his first hundred days in office, which began March 4, 1933, Roosevelt spearheaded unprecedented major legislation and issued a profusion of executive orders that instituted the New Deal—a variety of programs designed to produce relief (government jobs for the unemployed), recovery (economic growth), and reform (through regulation of Wall Street, banks and transportation). He created numerous programs to support the unemployed and farmers, and to encourage labor union growth while more closely regulating business and high finance. The repeal of Prohibition in 1933 added to his popularity, helping him win re-election by a landslide in 1936. The economy improved rapidly from 1933 to 1937, but then relapsed into a deep recession in 1937–38. The bipartisan Conservative Coalition that formed in 1937 prevented his packing the Supreme Court, and blocked almost all proposals for major liberal legislation (except the minimum wage, which did pass). When the war began and unemployment ended, conservatives in Congress repealed the two major relief programs, the WPA and CCC. However, they kept most of the regulations on business. Along with several smaller programs, major surviving programs include the Securities and Exchange Commission, the Wagner Act, the Federal Deposit Insurance Corporation and Social Security.\nAs World War II loomed after 1938, with the Japanese invasion of China and the aggression of Nazi Germany, Roosevelt gave strong diplomatic and financial support to China and the United Kingdom, while remaining officially neutral. His goal was to make America the \"Arsenal of Democracy\", which would supply munitions to the Allies. In March 1941, Roosevelt, with Congressional approval, provided Lend-Lease aid to Britain and China. Following the Japanese attack on Pearl Harbor on December 7, 1941, which he called \"a date which will live in infamy\", Roosevelt sought and obtained the quick approval, on December 8, of the United States Congress to declare war on Japan and, a few days later, on Germany. (Hitler had already declared war on the US in support of Japan). Assisted by his top aide Harry Hopkins, and with very strong national support, he worked closely with British Prime Minister Winston Churchill, Soviet leader Joseph Stalin and Chinese Generalissimo Chiang Kai-Shek in leading the Allies against Nazi Germany, Fascist Italy and Imperial Japan in World War II. He supervised the mobilization of the U.S. economy to support the war effort, and also ordered the internment of 100,000 Japanese American civilians. As an active military leader, Roosevelt implemented a war strategy on two fronts that ended in the defeat of the Axis Powers and the development of the world's first nuclear bomb. His work also influenced the later creation of the United Nations and Bretton Woods. During the war, unemployment dropped to 2%, relief programs largely ended, and the industrial economy grew rapidly to new heights as millions of people moved to wartime factory jobs or entered military service. Roosevelt's health seriously declined during the war years, and he died three months into his fourth term. He is often rated by scholars as one of the top three U.S. Presidents, along with Abraham Lincoln and George Washington.", "party": "Democratic", "president": "Franklin D. Roosevelt", "birth_year": 1882, "took_office": "1933-03-04"}, {"left_office": "1953-01-20", "img": "https://upload.wikimedia.org/wikipedia/commons/1/1b/Yellow_flag_waving.svg", "death_year": 1972, "number": 33, "summary": "Harry S. Truman (May 8, 1884 – December 26, 1972) was an American politician who served as the 33rd President of the United States (1945–53). He served as a United States Senator from Missouri (1935–45) and briefly as Vice President (1945) before he succeeded to the presidency on April 12, 1945 upon the death of Franklin D. Roosevelt. He was president during the final months of World War II, making the decision to drop atomic bombs on Hiroshima and Nagasaki. Truman was elected in his own right in 1948. He presided over an uncertain domestic scene as America sought its path after the war and tensions with the Soviet Union increased, marking the start of the Cold War.\nTruman was born in Lamar, Missouri and spent most of his youth on his family's 600-acre farm near Independence. In the last months of World War I, he served in combat in France as an artillery officer with his National Guard unit. After the war, he briefly owned a haberdashery in Kansas City, Missouri, and joined the Democratic Party and the political machine of Tom Pendergast. Truman was first elected to public office as a county official in 1922, and then as a U.S. Senator in 1934. He gained national prominence as chairman of the Truman Committee, formed in March 1941, which exposed waste, fraud, and corruption in Federal Government wartime contracts.\nNazi Germany surrendered on Truman's birthday (May 8) just a few weeks after he assumed the presidency, but the war with Imperial Japan raged on and was expected to last at least another year. Truman approved the use of atomic weaponry to end the fighting and to spare the tens of thousands of American lives that would inevitably be lost in the planned invasion of Japan and Japanese-held islands in the Pacific. Although this decision remains debated to this day, it is one of the principal factors that forced Japan's immediate and unconditional surrender.\nTruman's presidency was a turning point in foreign affairs, as the United States engaged in an internationalist foreign policy and renounced isolationism. Truman helped found the United Nations in 1945, issued the Truman Doctrine in 1947 to contain Communism, and got the $13 billion Marshall Plan enacted to rebuild Western Europe. The Soviet Union, a wartime ally, became a peacetime enemy in the Cold War. Truman oversaw the Berlin Airlift of 1948 and the creation of NATO in 1949. He was unable to stop Communists from taking over China. When communist North Korea invaded South Korea in 1950, he sent U.S. troops and gained UN approval for the Korean War. After initial successes in Korea, however, the UN forces were thrown back by Chinese intervention, and the conflict was stalemated throughout the final years of Truman's presidency.\nOn domestic issues, bills endorsed by Truman often faced opposition from a conservative Congress dominated by the Southern legislators, but his administration was able to successfully guide the American economy through the post-war economic challenges. Truman maintained that civil rights were a moral priority, and in 1948 submitted the first comprehensive civil rights legislation and issued Executive Orders to start racial integration in the military and federal agencies. Allegations were raised of corruption in the Truman administration, linked to certain cabinet members and senior White House staff, and this became a central campaign issue in the 1952 presidential election and may have contributed to Adlai Stevenson's (Truman's successor as Democratic nominee) loss to Republican nominee Dwight D. Eisenhower. Popular and scholarly assessments of Truman's presidency initially were unfavorable but became more positive over time following his retirement from politics. Truman's 1948 election upset to win a full term as president has often been invoked by later 'underdog' presidential candidates.", "party": "Democratic", "president": "Harry S. Truman", "birth_year": 1884, "took_office": "1945-04-12"}, {"left_office": "1961-01-20", "img": "https://upload.wikimedia.org/wikipedia/en/6/69/P_vip.svg", "death_year": 1969, "number": 34, "summary": "Dwight David \"Ike\" Eisenhower (/ˈaɪzənˌhaʊ.ər/ EYE-zən-HOW-ər; October 14, 1890 – March 28, 1969) was an American politician and general who served as the 34th President of the United States from 1953 until 1961. He was a five-star general in the United States Army during World War II and served as Supreme Commander of the Allied Forces in Europe. He was responsible for planning and supervising the invasion of North Africa in Operation Torch in 1942–43 and the successful invasion of France and Germany in 1944–45 from the Western Front. In 1951, he became the first Supreme Commander of NATO.\nEisenhower was of Pennsylvania Dutch and a lesser amount of Irish ancestry, and was raised in a large family in Kansas by parents with a strong religious background. He graduated from West Point in 1915 and later married Mamie Doud and had two sons. After World War II, Eisenhower served as Army Chief of Staff under President Harry S. Truman and then accepted the post of President at Columbia University.\nEisenhower entered the 1952 presidential race as a Republican to counter the non-interventionism of Senator Robert A. Taft, campaigning against \"communism, Korea and corruption.\" He won in a landslide, defeating Democratic candidate Adlai Stevenson and temporarily upending the New Deal Coalition. Eisenhower was the first U.S. president to be constitutionally term-limited under the 22nd Amendment.\nEisenhower's main goals in office were to keep pressure on the Soviet Union and reduce federal deficits. In the first year of his presidency, he threatened the use of nuclear weapons in an effort to conclude the Korean War; his New Look policy of nuclear deterrence prioritized inexpensive nuclear weapons while reducing funding for conventional military forces. He ordered coups in Iran and Guatemala. Eisenhower gave major aid to help France in Vietnam. He gave strong financial support to the new nation of South Vietnam. Congress agreed to his request in 1955 for the Formosa Resolution, which obliged the U.S. to militarily support the pro-Western Republic of China in Taiwan and continue the isolation of the People's Republic of China.\nAfter the Soviet Union launched the world's first artificial satellite in 1957, Eisenhower authorized the establishment of NASA, which led to the space race. During the Suez Crisis of 1956, Eisenhower condemned the Israeli, British and French invasion of Egypt, and forced them to withdraw. He also condemned the Soviet invasion during the Hungarian Revolution of 1956 but took no action. In 1958, Eisenhower sent 15,000 U.S. troops to Lebanon to prevent the pro-Western government from falling to a Nasser-inspired revolution. Near the end of his term, his efforts to set up a summit meeting with the Soviets collapsed because of the U-2 incident. In his January 17, 1961 farewell address to the nation, Eisenhower expressed his concerns about the dangers of massive military spending, particularly deficit spending and government contracts to private military manufacturers, and coined the term \"military–industrial complex\".\nOn the domestic front, he covertly opposed Joseph McCarthy and contributed to the end of McCarthyism by openly invoking the modern expanded version of executive privilege. He otherwise left most political activity to his Vice President, Richard Nixon. Eisenhower was a moderate conservative who continued New Deal agencies and expanded Social Security. He also launched the Interstate Highway System, the Defense Advanced Research Projects Agency (DARPA), the establishment of strong science education via the National Defense Education Act, and encouraged peaceful use of nuclear power via amendments to the Atomic Energy Act.\nEisenhower's two terms saw considerable economic prosperity except for a sharp recession in 1958–59. Voted Gallup's most admired man twelve times, he achieved widespread popular esteem both in and out of office. Since the late 20th century, consensus among Western scholars has consistently held Eisenhower as one of the greatest U.S. Presidents.", "party": "Republican", "president": "Dwight D. Eisenhower", "birth_year": 1890, "took_office": "1953-01-20"}, {"left_office": "1963-11-22", "img": "https://upload.wikimedia.org/wikipedia/en/e/eb/Executive_Order_10924_from_NARA.jpg", "death_year": 1963, "number": 35, "summary": "John Fitzgerald \"Jack\" Kennedy (May 29, 1917 – November 22, 1963), commonly referred to by his initials JFK, was an American politician who served as the 35th President of the United States from January 1961 until his assassination in November 1963. The Cuban Missile Crisis, The Bay of Pigs Invasion, the Nuclear Test Ban Treaty, the establishment of the Peace Corps, developments in the Space Race, the building of the Berlin Wall, the Trade Expansion Act to lower tariffs, and the Civil Rights Movement all took place during his presidency. A member of the Democratic Party, his New Frontier domestic program was largely enacted as a memorial to him after his death.\nKennedy's time in office was marked by high tensions with Communist states. He increased the number of American military advisers in South Vietnam by a factor of 18 over Eisenhower. In Cuba, a failed attempt was made at the Bay of Pigs to overthrow the country's dictator Fidel Castro in April 1961. Kennedy's administration subsequently rejected plans by the Joint Chiefs of Staff to orchestrate false-flag attacks on American soil in order to gain public approval for a war against Cuba. In October 1962, it was discovered Soviet ballistic missiles had been deployed in Cuba; the resulting period of unease, termed the Cuban Missile Crisis, is seen by many historians as the closest the human race has ever come to nuclear war between nuclear armed belligerents.\nAfter military service in the United States Naval Reserve in World War II, Kennedy represented Massachusetts's 11th congressional district in the U.S. House of Representatives from 1947 to 1953. He was elected subsequently to the U.S. Senate and served as the junior Senator from Massachusetts from 1953 until 1960. Kennedy defeated Vice President, and Republican candidate, Richard Nixon in the 1960 U.S. Presidential Election. At age 43, he became the youngest elected president  and the second-youngest president (after Theodore Roosevelt, who was 42 when he became president after the assassination of William McKinley). Kennedy was also the first person born in the 20th century to serve as president. To date, Kennedy has been the only Roman Catholic president and the only president to have won a Pulitzer Prize (for his biography Profiles in Courage).\nKennedy was assassinated in Dallas, Texas on November 22, 1963. Lee Harvey Oswald was arrested that afternoon and determined to have fired shots that hit the President from a sixth floor window of the Texas School Book Depository. Dallas nightclub owner Jack Ruby mortally wounded Oswald two days later in a jail corridor. The FBI and the Warren Commission officially concluded that Oswald was the lone assassin, but its report was sharply criticized. The United States House Select Committee on Assassinations (HSCA) agreed that Oswald fired the shots that killed the president, but also concluded that Kennedy was likely assassinated as the result of a conspiracy. The majority of Americans alive at the time of the assassination: 52% to 29%, and continuing through 2013 (61% to 30%), believed that there was a conspiracy and that Oswald was not the only shooter.\nSince the 1960s, information concerning Kennedy's private life has come to light, including his health problems and allegations of infidelity. Kennedy continues to rank highly in historians' polls of U.S. presidents and with the general public. His average approval rating of 70% is the highest of any president in Gallup's history of systematically measuring job approval.", "party": "Democratic", "president": "John F. Kennedy", "birth_year": 1917, "took_office": "1961-01-20"}, {"left_office": "1969-01-20", "img": "https://upload.wikimedia.org/wikipedia/commons/3/35/Texas_flag_map.svg", "death_year": 1973, "number": 36, "summary": "Lyndon Baines Johnson (/ˈlɪndən ˈbeɪnz ˈdʒɒnsən/; August 27, 1908 – January 22, 1973), often referred to as LBJ, was an American politician who served as the 36th President of the United States from 1963 to 1969, assuming the office after serving as the 37th Vice President of the United States under President John F. Kennedy, from 1961 to 1963. Johnson was a Democrat from Texas, who served as a United States Representative from 1937 to 1949 and as a United States Senator from 1949 to 1961. He spent six years as Senate Majority Leader, two as Senate Minority Leader, and two as Senate Majority Whip.\nJohnson ran for the Democratic nomination in the 1960 presidential election. Although unsuccessful, he was chosen by Senator John F. Kennedy of Massachusetts to be his running mate. They went on to win a close election over Richard Nixon and Johnson was sworn in as Vice President on January 20, 1961. Two years and ten months later, on November 22, 1963, Johnson succeeded Kennedy as President following the latter's assassination. He ran for a full term in the 1964 election, winning by a landslide over Republican opponent Arizona Senator Barry Goldwater. He is one of four people who have served as President and Vice President, as well as in both houses of Congress. Johnson was renowned for his domineering, sometimes abrasive, personality and the \"Johnson treatment\"—his aggressive coercion of powerful politicians to advance legislation.\nJohnson designed the \"Great Society\" legislation upholding civil rights, public broadcasting, Medicare, Medicaid, aid to education, the arts, urban and rural development, public services, and his \"War on Poverty\". Assisted in part by a growing economy, the War on Poverty helped millions of Americans rise above the poverty line during Johnson's presidency. Civil rights bills signed by Johnson banned racial discrimination in public facilities, interstate commerce, the workplace, and housing; and the Voting Rights Act banned certain requirements in southern states used to disenfranchise African Americans. With the passage of the Immigration and Nationality Act of 1965, the country's immigration system was reformed and all racial origin quotas were removed (replaced by national origin quotas).\nJohnson escalated American involvement in the Vietnam War. In 1964, Congress passed the Gulf of Tonkin Resolution, which granted Johnson the power to use military force in Southeast Asia without having to ask for an official declaration of war. The number of American military personnel in Vietnam increased dramatically, from 16,000 advisors in non-combat roles in 1963, to 550,000 in early 1968, many in combat roles. American casualties soared and the peace process bogged down. Growing unease with the war stimulated a large, angry antiwar movement based especially on university campuses in the U.S. and abroad.\nJohnson faced further troubles when summer riots broke out in most major cities after 1965, and crime rates soared, as his opponents raised demands for \"law and order\" policies. While he began his presidency with widespread approval, support for Johnson declined as the public became upset with both the war and the growing violence at home. In 1968, the Democratic Party factionalized as antiwar elements denounced Johnson; he ended his bid for renomination after a disappointing finish in the New Hampshire primary. Republican Richard Nixon was elected to succeed him, as the New Deal coalition that had dominated presidential politics for 36 years collapsed. After he left office in January 1969, Johnson returned to his Texas ranch where he died of a heart attack at age 64 on January 22, 1973.\nHistorians argue that Johnson's presidency marked the peak of modern liberalism in the United States after the New Deal era. Johnson is ranked favorably by some historians because of his domestic policies and the passage of many major laws, affecting civil rights, gun control, wilderness preservation, and Social Security.", "party": "Democratic", "president": "Lyndon B. Johnson", "birth_year": 1908, "took_office": "1963-11-22"}, {"left_office": "1974-08-09", "img": "https://upload.wikimedia.org/wikipedia/commons/6/6c/Richard_Nixon_1969_inauguration.png", "death_year": 1994, "number": 37, "summary": "Richard Milhous Nixon (January 9, 1913 – April 22, 1994) was the 37th President of the United States who served from 1969 to 1974, when he became the only U.S. president to resign the office. Nixon had previously served as a U.S. Representative and Senator from California and as the 36th Vice President of the United States from 1953 to 1961.\nNixon was born in Yorba Linda, California. After completing his undergraduate studies at Whittier College, he graduated from Duke University School of Law in 1937 and returned to California to practice law. He and his wife, Pat Nixon, moved to Washington in 1942 to work for the federal government. He subsequently served on active duty in the U.S. Navy Reserve during World War II. Nixon was elected to the House of Representatives in 1946 and to the Senate in 1950. His pursuit of the Hiss Case established his reputation as a leading anti-communist, and elevated him to national prominence. He was the running mate of Dwight D. Eisenhower, the Republican Party presidential nominee in the 1952 election. Nixon served for eight years as vice president. He waged an unsuccessful presidential campaign in 1960, narrowly losing to John F. Kennedy, and lost a race for Governor of California to Pat Brown in 1962. In 1968 he ran again for the presidency and was elected when he defeated Hubert Humphrey.\nNixon ended American involvement in the war in Vietnam in 1973 and brought the American POWs home, and ended the military draft. Nixon's visit to the People's Republic of China in 1972 opened diplomatic relations between the two nations, and he initiated détente and the Anti-Ballistic Missile Treaty with the Soviet Union the same year. His administration generally transferred power from Washington to the states. He imposed wage and price controls for a period of ninety days, enforced desegregation of Southern schools and established the Environmental Protection Agency. Nixon also presided over the Apollo 11 moon landing, which signaled the end of the moon race. He was reelected in one of the largest electoral landslides in U.S. history in 1972, when he defeated George McGovern.\nThe year 1973 saw an Arab oil embargo, gasoline rationing, and a continuing series of revelations about the Watergate scandal. The scandal escalated, costing Nixon much of his political support, and on August 9, 1974, he resigned in the face of almost certain impeachment and removal from office. After his resignation, he was issued a pardon by his successor, Gerald Ford. In retirement, Nixon's work writing several books and undertaking of many foreign trips helped to rehabilitate his image. He suffered a debilitating stroke on April 18, 1994, and died four days later at the age of 81.", "party": "Republican", "president": "Richard Nixon", "birth_year": 1913, "took_office": "1969-01-20"}, {"left_office": "1977-01-20", "img": "https://upload.wikimedia.org/wikipedia/commons/0/09/Seal_of_the_United_States_Department_of_the_Navy.svg", "death_year": 2006, "number": 38, "summary": "Gerald Rudolph Ford Jr. (born Leslie Lynch King Jr.; July 14, 1913 – December 26, 2006) was an American politician who served as the 38th President of the United States from 1974 to 1977. Prior to this he was the 40th Vice President of the United States, serving from 1973 until President Richard Nixon's resignation in 1974. He was the first person appointed to the vice presidency under the terms of the 25th Amendment, following the resignation of Vice President Spiro Agnew on October 10, 1973. Becoming president upon Richard Nixon's departure on August 9, 1974, he claimed the distinction as the first and to date the only person to have served as both Vice President and President of the United States without being elected to either office. As he was appointed to fill a vacancy and then succeeded to the presidency, Ford also earned the distinction of being the only person in American history to neither begin nor finish either a presidential or vice presidential term on the date of a regularly-scheduled inauguration. Before ascending to the vice presidency, Ford served 25 years as Representative from Michigan's 5th congressional district, the final 9 of them as the House Minority Leader.\nAs President, Ford signed the Helsinki Accords, marking a move toward détente in the Cold War. With the conquest of South Vietnam by North Vietnam nine months into his presidency, U.S. involvement in Vietnam essentially ended. Domestically, Ford presided over the worst economy in the four decades since the Great Depression, with growing inflation and a recession during his tenure. One of his more controversial acts was to grant a presidential pardon to President Richard Nixon for his role in the Watergate scandal. During Ford's presidency, foreign policy was characterized in procedural terms by the increased role Congress began to play, and by the corresponding curb on the powers of the President. In the GOP presidential primary campaign of 1976, Ford defeated then-former California Governor Ronald Reagan for the Republican nomination. He narrowly lost the presidential election to the Democratic challenger, then-former Georgia Governor Jimmy Carter, on November 2.\nFollowing his years as President, Ford remained active in the Republican Party. After experiencing health problems, he died in his home on December 26, 2006. Ford lived longer than any other U.S. president, 93 years and 165 days, while his 895-day presidency remains the shortest term of all presidents who did not die in office. He is also the most recent former president and vice president to die.", "party": "Republican", "president": "Gerald Ford", "birth_year": 1913, "took_office": "1974-08-09"}, {"left_office": "1981-01-20", "img": "https://upload.wikimedia.org/wikipedia/commons/0/06/Wiktionary-logo-v2.svg", "death_year": null, "number": 39, "summary": "James Earl \"Jimmy\" Carter Jr. (born October 1, 1924) is an American politician and author who served as the 39th President of the United States from 1977 to 1981. In 2002, he was awarded the Nobel Peace Prize for his work with the Carter Center.\nCarter, a Democrat raised in rural Georgia, was a peanut farmer who served two terms as a Georgia State Senator, from 1963 to 1967, and one as the Governor of Georgia, from 1971 to 1975. He was elected President in 1976, defeating incumbent President Gerald Ford in a relatively close election; the Electoral College margin of 57 votes was the closest at that time since 1916.\nOn his second day in office, Carter pardoned all evaders of the Vietnam War drafts. During Carter's term as President, two new cabinet-level departments, the Department of Energy and the Department of Education were established. He established a national energy policy that included conservation, price control, and new technology. In foreign affairs, Carter pursued the Camp David Accords, the Panama Canal Treaties, the second round of Strategic Arms Limitation Talks (SALT II), and the return of the Panama Canal Zone to Panama. On the economic front he confronted persistent \"stagflation\", a combination of high inflation, high unemployment and slow growth. The end of his presidential tenure was marked by the 1979–1981 Iran hostage crisis, the 1979 energy crisis, the Three Mile Island nuclear accident, and the Soviet invasion of Afghanistan. In response to the Soviet move he ended détente, escalated the Cold War, and led the international boycott of the 1980 Summer Olympics in Moscow. By 1980, Carter's popularity had eroded such that, running for re-election that year, he was challenged by Senator Ted Kennedy in the Democratic Party's primaries for the presidential nomination, marking the most recent Democratic primary in which an incumbent faced serious opposition. Carter won the 1980 primary with 51.13% of the vote (all incumbent candidates since have won at least 72.8% of their party's primary votes) but lost the general election in an electoral landslide to Republican nominee Ronald Reagan, who won 44 of 50 states.\nHis presidency has drawn medium-low responses from historians, with many considering him to have accomplished more with his post-presidency work. He set up the Carter Center in 1982 as his base for advancing human rights. He has also traveled extensively to conduct peace negotiations, observe elections, and advance disease prevention and eradication in developing nations. Additionally, Carter is a key figure in the Habitat for Humanity project. Regarding current political views, he has criticized of some of Israel's actions and policies in regards to the Israeli–Palestinian conflict. He has vigorously opposed the Supreme Court's decision in Citizens United v. FEC to strike down McCain-Feingold limits on campaign spending by corporations and unions, saying that the U.S. is \"no longer a functioning democracy\" and now has a system of \"unlimited political bribery.\" He is a supporter of President Obama but has been critical of aspects of his foreign policy, particularly with regard to the use of drones and Obama's failure to close Guantanamo Bay detention camp. With his 35-year post-presidency, Carter is the longest-retired president in American history, breaking the record previously held by Herbert Hoover in 2012.\nIn August 2015, at age 90, Carter was diagnosed with melanoma that had metastasized to his liver and brain, and he began treatment which included surgery, immunotherapy, and radiation. Less than four months later, on December 6, 2015, Carter, then 91, said that his medical scans no longer showed any cancer, and on March 7, 2016, he concluded his cancer treatment.", "party": "Democratic", "president": "Jimmy Carter", "birth_year": 1924, "took_office": "1977-01-20"}, {"left_office": "1989-01-20", "img": "https://upload.wikimedia.org/wikipedia/commons/1/1d/Ronald_Reagan_in_Dixon%2C_Illinois%2C_1920s.jpg", "death_year": 2004, "number": 40, "summary": "Ronald Wilson Reagan (/ˈrɒnəld ˈwɪlsən ˈreɪɡən/; February 6, 1911 – June 5, 2004) was an American politician and actor who served as the 40th President of the United States from 1981 to 1989. Prior to his presidency, he was the 33rd Governor of California from 1967 to 1975, following a career as a Hollywood actor and union leader.\nRaised in a poor family in small towns of northern Illinois, Ronald Reagan graduated from Eureka College in 1932 and worked as a sports announcer on several regional radio stations. After moving to Hollywood in 1937, he became an actor and starred in a few major productions. Reagan was twice elected as President of the Screen Actors Guild, the labor union for actors, where he worked to root out Communist influence. In the 1950s, he moved into television and was a motivational speaker at General Electric factories. Having been a lifelong Democrat, his views changed. He became a conservative and in 1962 switched to the Republican Party. In 1964, Reagan's speech, \"A Time for Choosing\", in support of Barry Goldwater's floundering presidential campaign, earned him national attention as a new conservative spokesman. Building a network of supporters, he was elected Governor of California in 1966. As governor, Reagan raised taxes, turned a state budget deficit to a surplus, challenged the protesters at the University of California, ordered National Guard troops in during a period of protest movements in 1969, and was re-elected in 1970. He twice ran unsuccessfully for the Republican nomination for the U.S. presidency in 1968 and 1976; four years later, he easily won the nomination outright, going on to be elected the oldest President, defeating incumbent Jimmy Carter in 1980.\nEntering the presidency in 1981, Reagan implemented sweeping new political and economic initiatives. His supply-side economic policies, dubbed \"Reaganomics\", advocated tax rate reduction to spur economic growth, control of the money supply to curb inflation, economic deregulation, and reduction in government spending. In his first term he survived an assassination attempt, escalated the War on Drugs, and fought public-sector labor. Over his two terms, his economic policies saw a reduction of inflation from 12.5% to 4.4%, and an average annual growth of real GDP of 3.4%; while Reagan did enact cuts in domestic discretionary spending, increased military spending contributed to increased federal outlays overall, even after adjustment for inflation. During his re-election bid, Reagan campaigned on the notion that it was \"Morning in America\", winning a landslide in 1984 with the largest electoral college victory in history. Foreign affairs dominated his second term, including ending of the Cold War, the bombing of Libya, and the Iran–Contra affair. Publicly describing the Soviet Union as an \"evil empire\", he transitioned Cold War policy from détente to rollback, by escalating an arms race with the USSR while engaging in talks with Soviet General Secretary Mikhail Gorbachev, which culminated in the INF Treaty, shrinking both countries' nuclear arsenals. During his famous speech at the Brandenburg Gate, President Reagan challenged Gorbachev to \"tear down this wall!\". Five months after the end of his term, the Berlin Wall fell, and on December 26, 1991, nearly three years after he left office, the Soviet Union collapsed.\nLeaving office in 1989, Reagan held an approval rating of sixty-eight percent, matching those of Franklin D. Roosevelt, and later Bill Clinton, as the highest ratings for departing presidents in the modern era. While having planned an active post-presidency, in 1994 Reagan disclosed his diagnosis with Alzheimer's disease earlier that year, appearing publicly for the last time at the funeral of Richard Nixon; he died ten years later in 2004 at the age of 93. An icon among Republicans, he ranks favorably in public and critical opinion of U.S. Presidents, and his tenure constituted a realignment toward conservative policies in the United States.", "party": "Republican", "president": "Ronald Reagan", "birth_year": 1911, "took_office": "1981-01-20"}, {"left_office": "1993-01-20", "img": "https://upload.wikimedia.org/wikipedia/commons/f/f5/Terra.png", "death_year": null, "number": 41, "summary": "George Herbert Walker Bush (born June 12, 1924), also known as George Bush Sr., is an American politician who was the 41st President of the United States from 1989 to 1993 and the 43rd Vice President of the United States from 1981 to 1989. A member of the U.S. Republican Party, he was previously a congressman, ambassador, and Director of Central Intelligence. He is the oldest living former President and Vice President. He is also the last living former President who is a veteran of World War II. Bush is often referred to as \"George H. W. Bush\", \"Bush 41\", \"Bush the Elder\", \"Papa Bush\", or \"George Bush Sr.\" to distinguish him from his eldest son, George W. Bush, who was the 43rd President of the United States. Prior to his son's presidency, he was known simply as George Bush or President Bush.\nBush was born in Milton, Massachusetts, to Prescott Bush and Dorothy Walker Bush. Following the attack on Pearl Harbor in 1941, Bush postponed college, enlisted in the U.S. Navy on his 18th birthday, and became the youngest aviator in the U.S. Navy at the time. He served until the end of the war, then attended Yale University. Graduating in 1948, he moved his family to West Texas and entered the oil business, becoming a millionaire by the age of 40.\nBush became involved in politics soon after founding his own oil company, serving as a member of the House of Representatives and Director of Central Intelligence, among other positions. He failed to win the Republican nomination for President in 1980, but was chosen as a running mate by party nominee Ronald Reagan, and the two were elected. During his tenure, Bush headed administration task forces on deregulation and fighting the \"War on Drugs\".\nIn 1988, Bush ran a successful campaign to succeed Reagan as President, defeating Democratic opponent Michael Dukakis. Foreign policy drove the Bush presidency: military operations were conducted in Panama and the Persian Gulf; the Berlin Wall fell in 1989, and the Soviet Union dissolved two years later. Domestically, Bush reneged on a 1988 campaign promise and, after a struggle with Congress, signed an increase in taxes that Congress had passed. In the wake of a weak recovery from an economic recession, along with continuing budget deficits and the controversy over his appointment of Clarence Thomas to the Supreme Court, he lost the 1992 presidential election to Democrat Bill Clinton.\nBush left office in 1993. His presidential library was dedicated in 1997, and he has been active—often alongside Bill Clinton—in various humanitarian activities. Besides being the 43rd president (2001–09), his son George also served as the 46th Governor of Texas (1995–2000) and is one of only two presidents—the other being John Quincy Adams—to be the son of a former president. His second son, Jeb Bush, served as the 43rd Governor of Florida (1999–2007) and made an unsuccessful run for president in 2016.", "party": "Republican", "president": "George H. W. Bush", "birth_year": 1924, "took_office": "1989-01-20"}, {"left_office": "2001-01-20", "img": "https://upload.wikimedia.org/wikipedia/commons/2/27/Signature_of_Bill_Clinton.svg", "death_year": null, "number": 42, "summary": "William Jefferson \"Bill\" Clinton (born William Jefferson Blythe III; August 19, 1946) is an American politician who was the 42nd President of the United States from 1993 to 2001. Clinton was previously Governor of Arkansas from 1979 to 1981 and 1983 to 1992, and the Arkansas Attorney General from 1977 to 1979. A member of the Democratic Party, ideologically Clinton was a New Democrat, and many of his policies reflected a centrist \"Third Way\" political philosophy.\nClinton was born and raised in Arkansas, and is an alumnus of Georgetown University, where he was a member of Kappa Kappa Psi and the Phi Beta Kappa Society and earned a Rhodes Scholarship to attend the University of Oxford. Clinton is married to Hillary Clinton, who served as United States Secretary of State from 2009 to 2013, who was a Senator from New York from 2001 to 2009, and who is the Democratic nominee for President of the United States in 2016. Both Clintons earned law degrees from Yale Law School, where they met and began dating. As Governor of Arkansas, Clinton overhauled the state's education system, and served as chairman of the National Governors Association.\nClinton was elected President in 1992, defeating incumbent George H. W. Bush. At age 46, Clinton was the third-youngest president, and the first from the Baby Boomer generation. Clinton presided over the longest period of peacetime economic expansion in American history, and signed into law the North American Free Trade Agreement. After failing to pass national health care reform, the Democratic House was ousted when the Republican Party won control of the Congress in 1994, for the first time in 40 years. Two years later, Clinton became the first Democrat since Franklin D. Roosevelt to be elected President twice. Clinton passed welfare reform and the State Children's Health Insurance Program, providing health coverage for millions of children. He was reelected to a second term in 1996.\nIn 1998, Clinton was impeached by the House of Representatives for perjury before a grand jury and obstruction of justice during a lawsuit against him, both related to a scandal involving White House (and later Department of Defense) employee Monica Lewinsky. Clinton was acquitted by the U.S. Senate in 1999, and served his complete term of office. The Congressional Budget Office reported a budget surplus between the years 1998 and 2000, the last three years of Clinton's presidency. In foreign policy, Clinton ordered U.S. military intervention in the Bosnia and Kosovo wars, signed the Iraq Liberation Act in opposition to Saddam Hussein, and participated in the 2000 Camp David Summit to advance the Israeli–Palestinian peace process.\nClinton left office with the highest end-of-office approval rating of any U.S. President since World War II. Since then, Clinton has been involved in public speaking and humanitarian work. Clinton created the William J. Clinton Foundation to address international causes, such as the prevention of AIDS and global warming. In 2004, Clinton published his autobiography My Life. Clinton has remained active in politics by campaigning for Democratic candidates, including his wife's campaigns for the Democratic presidential nomination in 2008 and 2016, and Barack Obama's presidential campaigns in 2008 and 2012.\nIn 2009, Clinton was named the United Nations Special Envoy to Haiti, and after the 2010 Haiti earthquake, Clinton teamed with George W. Bush to form the Clinton Bush Haiti Fund. Since leaving office, Clinton has been rated highly in public opinion polls of U.S. Presidents.", "party": "Democratic", "president": "Bill Clinton", "birth_year": 1946, "took_office": "1993-01-20"}, {"left_office": "2009-01-20", "img": "https://upload.wikimedia.org/wikipedia/commons/9/97/Outstanding_Unit_ribbon.svg", "death_year": null, "number": 43, "summary": "George Walker Bush (born July 6, 1946) is an American politician who was the 43rd President of the United States from 2001 to 2009 and 46th Governor of Texas from 1995 to 2000. The eldest son of Barbara and George H. W. Bush, he was born in New Haven, Connecticut. After graduating from Yale University in 1968 and Harvard Business School in 1975, he worked in oil businesses. He married Laura Welch in 1977 and ran unsuccessfully for the House of Representatives shortly thereafter. He later co-owned the Texas Rangers baseball team before defeating Ann Richards in the 1994 Texas gubernatorial election. He was elected president in 2000 after a close and controversial election against Al Gore, becoming the fourth president to be elected while receiving fewer popular votes nationwide than an opponent. He is the second president to have been the son of a former president, the first having been John Quincy Adams. He is also the brother of Jeb Bush, a former Governor of Florida and candidate for the Republican presidential nomination in the 2016 presidential election.\nEight months into Bush's first term as president, the September 11 terrorist attacks occurred. Bush responded with what became known as the Bush Doctrine: launching a \"War on Terror\", an international military campaign which included the war in Afghanistan, in 2001, and the Iraq War, in 2003. He also promoted policies on the economy, health care, education, social security reform, and amending the Constitution to prohibit same-sex marriage. He signed into law broad tax cuts, the Patriot Act, the No Child Left Behind Act, the Partial-Birth Abortion Ban Act, Medicare prescription drug benefits for seniors, and funding for the AIDS relief program known as PEPFAR. His tenure saw national debates on immigration, Social Security, electronic surveillance, and torture.\nBush successfully ran for re-election against Democratic Senator John Kerry in 2004, in another relatively close election. After his re-election, Bush received increasingly heated criticism from across the political spectrum for his handling of the Iraq War, Hurricane Katrina, and other challenges. Amid this criticism, the Democratic Party regained control of Congress in the 2006 elections. In December 2007, the United States entered its longest post-World War II recession, often referred to as the \"Great Recession\", prompting the Bush administration to obtain congressional passage of multiple economic programs intended to preserve the country's financial system. Nationally, Bush was both one of the most popular and unpopular presidents in history, having received the highest recorded presidential approval ratings in the wake of the September 11 attacks, as well as one of the lowest approval ratings during the 2008 financial crisis. He was met with public protests during visits to the United Kingdom.\nBush left office in 2009, returning to Texas where he purchased a home in suburban Dallas. He is currently a public speaker, and has written a memoir, Decision Points. His presidential library was opened in 2013. His presidency has been ranked among the worst in surveys of presidential scholars published in the late 2000s and 2010s.", "party": "Republican", "president": "George W. Bush", "birth_year": 1946, "took_office": "2001-01-20"}, {"left_office": null, "img": "https://upload.wikimedia.org/wikipedia/en/a/ae/Flag_of_the_United_Kingdom.svg", "death_year": null, "number": 44, "summary": "Barack Hussein Obama II (US /bəˈrɑːk huːˈseɪn oʊˈbɑːmə/; born August 4, 1961) is an American politician who is the 44th and current President of the United States. He is the first African American to hold the office and the first president born outside the continental United States. Born in Honolulu, Hawaii, Obama is a graduate of Columbia University and Harvard Law School, where he was president of the Harvard Law Review. He was a community organizer in Chicago before earning his law degree. He worked as a civil rights attorney and taught constitutional law at the University of Chicago Law School between 1992 and 2004. While serving three terms representing the 13th District in the Illinois Senate from 1997 to 2004, he ran unsuccessfully in the Democratic primary for the United States House of Representatives in 2000 against incumbent Bobby Rush.\nIn 2004, Obama received national attention during his campaign to represent Illinois in the United States Senate with his victory in the March Democratic Party primary, his keynote address at the Democratic National Convention in July, and his election to the Senate in November. He began his presidential campaign in 2007 and, after a close primary campaign against Hillary Clinton in 2008, he won sufficient delegates in the Democratic Party primaries to receive the presidential nomination. He then defeated Republican nominee John McCain in the general election, and was inaugurated as president on January 20, 2009. Nine months after his inauguration, Obama was named the 2009 Nobel Peace Prize laureate.\nDuring his first two years in office, Obama signed into law economic stimulus legislation in response to the Great Recession in the form of the American Recovery and Reinvestment Act of 2009 and the Tax Relief, Unemployment Insurance Reauthorization, and Job Creation Act of 2010. Other major domestic initiatives in his first term included the Patient Protection and Affordable Care Act, often referred to as \"Obamacare\"; the Dodd–Frank Wall Street Reform and Consumer Protection Act; and the Don't Ask, Don't Tell Repeal Act of 2010. In foreign policy, Obama ended U.S. military involvement in the Iraq War, increased U.S. troop levels in Afghanistan, signed the New START arms control treaty with Russia, ordered U.S. military involvement in Libya in opposition to Muammar Gaddafi, and ordered the military operation that resulted in the death of Osama bin Laden. In January 2011, the Republicans regained control of the House of Representatives as the Democratic Party lost a total of 63 seats; and, after a lengthy debate over federal spending and whether or not to raise the nation's debt limit, Obama signed the Budget Control Act of 2011 and the American Taxpayer Relief Act of 2012.\nObama was reelected president in November 2012, defeating Republican nominee Mitt Romney, and was sworn in for a second term on January 20, 2013. During his second term, Obama has promoted domestic policies related to gun control in response to the Sandy Hook Elementary School shooting, and has called for greater inclusiveness for LGBT Americans, while his administration has filed briefs which urged the Supreme Court to strike down part of the federal Defense of Marriage Act and state level same-sex marriage bans as unconstitutional. In foreign policy, Obama ordered U.S. military intervention in Iraq in response to gains made by ISIL after the 2011 withdrawal from Iraq, continued the process of ending U.S. combat operations in Afghanistan, promoted discussions that led to the 2015 Paris Agreement on global climate change, brokered a nuclear deal with Iran, and normalized U.S. relations with Cuba.", "party": "Democratic", "president": "Barack Obama", "birth_year": 1961, "took_office": "2009-01-20"}]